//*ASSEMBLER COMPILATION========================================
//ASMC     PROC INFILE='',OUTFILE='',ASMAOPTS=''
//COMPILE  EXEC PGM=ASMA90,PARM='&ASMAOPTS'
//SYSIN    DD   DSN=&INFILE,DISP=SHR
//SYSLIN   DD   DSN=&OUTFILE,DISP=SHR
//SYSLIB   DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//         DD   DSN=SYS1.MODGEN,DISP=SHR
//         DD   DSN=SYS1.MACLIB,DISP=SHR
//*        DD   DSN=DACF.MACLIB,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//SYSADATA DD   DUMMY
//         PEND
