//ASMCOMP  JOB (EMC),'ASMBUILD',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,REGION=0M,MSGLEVEL=(1,1)
//*
//*
//***************************************************************
//* THIS SAMPLE JCL IS TO COMPILE SPECIFIED HLASM SOURCE FROM THE
//* SPECIFIED LIBRARY AND TO LINKEDIT THE RESULT OBJECT FILE INTO
//* THE LOAD MODULE AND PLACE IT TO THE SPECIFIED OUTPUT LIBRARY.
//***************************************************************
//*
//* SUBSTITUTION VARIABLES SET UP
//         SET  USRHLQ=&SYSUID..SLIP
//         SET  PGMSRC='TEST'
//*
//* DELETE ASMLIST, LINKLIST, OBJ AND SYSADATA MEMBERS CREATED BY
//* PREVIOUS BUILD
//BUILDCLN EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
 DELETE ASHCHE1.SLIP.ASMLIST(TEST)
 DELETE ASHCHE1.SLIP.LINKLIST(TEST)
 DELETE ASHCHE1.SLIP.OBJ(TEST)
 DELETE ASHCHE1.SLIP.SYSADATA(TEST)
 SET MAXCC=0
/*
//*
//* CALL HLASM COMPILER
//COMPILE  EXEC PGM=ASMA90,
//             PARM=''
//SYSIN    DD   DSN=&USRHLQ..ASM(&PGMSRC),DISP=SHR
//SYSLIB   DD   DSN=&USRHLQ..MACLIB,DISP=SHR
//         DD   DSN=SYS9.ZOS1D0.MACLIB,DISP=SHR
//         DD   DSN=SYS9.ZOS1D0.MODGEN,DISP=SHR
//         DD   DSN=SYS1.SHASMAC,DISP=SHR
//         DD   DSN=SYS9.SASMMAC1,DISP=SHR
//         DD   DSN=SYS9.SASMMAC2,DISP=SHR
//*        DD   DSN=CEE.SCEEMAC,DISP=SHR
//*        DD   DSN=TCPIP.SEZACMAC,DISP=SHR
//*        DD   DSN=SYS1.SAMPLIB,DISP=SHR
//*        DD   DSN=DBCOLE.XDCZ1D.XDCMACS,DISP=SHR
//ASMAOPT  DD   DSN=&USRHLQ..ASMOPTS(&PGMSRC),DISP=SHR
//         DD   *
/*
//SYSUT1   DD   DSN=&&SYSUT1,SPACE=(4096,(120,120),,,ROUND),
//             UNIT=SYSALLDA,DCB=BUFNO=1
//SYSADATA DD   DSN=&USRHLQ..SYSADATA(&PGMSRC),
//             DCB=(BLKSIZE=27998,LRECL=8188,RECFM=VB,BUFNO=1),
//             SPACE=(27998,(10,10),,,ROUND),UNIT=SYSALLDA,
//             DISP=(MOD,KEEP,KEEP)
//SYSPRINT DD   DSN=&USRHLQ..ASMLIST(&PGMSRC),
//             DCB=(BLKSIZE=27998,LRECL=137,RECFM=VBA,BUFNO=1),
//             SPACE=(CYL,(25,100),,,ROUND),UNIT=SYSALLDA,
//             DISP=(MOD,KEEP,KEEP)
//SYSTERM  DD   SYSOUT=*
//SYSLIN   DD   DSN=&USRHLQ..OBJ(&PGMSRC),
//             DCB=(BLKSIZE=3040,LRECL=80,RECFM=FB,BUFNO=1),
//             SPACE=(3040,(40,40),,,ROUND),UNIT=SYSALLDA,
//             DISP=(MOD,PASS,KEEP)
//*
//* LINK EDIT OBJECT CODE INTO A LOAD MODULE
//LINK     EXEC PGM=HEWL,PARM='MAP,LET,LIST,NCAL',
//             COND=(4,LT,COMPILE)
//OBJLIB   DD   DSN=&USRHLQ..OBJ(&PGMSRC),DISP=(OLD,KEEP)
//SYSLIN   DD   DSN=&USRHLQ..LINKCARD(&PGMSRC),DISP=SHR
//SYSLMOD  DD   DSN=&USRHLQ..LINKLIB(&PGMSRC),
//             DISP=(MOD,KEEP,KEEP)
//SYSUT1   DD   DSN=&&SYSUT1,SPACE=(1024,(120,120),,,ROUND),
//             UNIT=SYSALLDA,BUFNO=1
//SYSPRINT DD   DSN=&USRHLQ..LINKLIST(&PGMSRC),
//             DCB=(BLKSIZE=27998,LRECL=137,RECFM=VBA,BUFNO=1),
//             SPACE=(CYL,(5,5),,,ROUND),UNIT=SYSALLDA,
//             DISP=(MOD,KEEP,KEEP)
//
