         GENREG                                                         00001000
SAMPLE   CSECT                                                          00010000
         STM   R14,R12,12(R13)                                          00010100
         BASR  R12,0                                                    00010200
         USING *,R12                                                    00010300
         B     TEST                                                     00010400
         MVIY  0(R12),23                                                00010500
         XR    R1,R1                                                    00010600
TEST     EQU   *                                                        00010700
         LM    R14,R12,12(R13)                                          00010800
         BR    R14                                                      00020000
         END                                                            00030000
