         GENREG                                                         00001000
SAMPLE   CSECT                                                          00010000
         STM   R14,R12,12(R13)                                          00010301
         BASR  R12,0                                                    00010401
         USING *,R12                                                    00010501
         ST    R13,SAVEAREA+4                                           00010602
         LR    R2,R13                                                   00010702
         LA    R13,SAVEAREA                                             00010802
         ST    R13,8(,R2)                                               00010902
                                                                        00011013
                                                                        00011315
*        ESTAE MYESTAE,CT,XCTL=YES,PARAM=DEBUG                          00011419
         ESPIE SET,MYESTAE,((1,15)),PARAM=DEBUG                         00011520
         LINK  EP=MODULE4                                               00011620
INF      B     INF                                                      00011720
         WTO   'GOAL'                                                   00011820
         LA    R2,GOAL                                                  00016518
         BCTR  R2,0                                                     00016618
         BR    R2                                                       00016718
         XR    R1,R1                                                    00016818
         XR    R1,R1                                                    00016918
         WTO   'ZERO R1'                                                00017018
GOAL     EQU   *                                                        00017118
*        ESTAE 0                                                        00017320
                                                                        00017402
         L     R13,SAVEAREA+4                                           00017806
                                                                        00017902
         LM    R14,R12,12(R13)                                          00018000
         DROP  R12                                                      00019013
         BR    R14                                                      00020000
                                                                        00020113
                                                                        00020219
SAVEAREA DS    18F                                                      00020318
SAMPLE2  DC    CL8'MODULE2 '                                            00020418
REPL     DS    FD                                                       00020518
ECB      DC    X'0000'                                                  00020618
                                                                        00020718
MYESTAE  CSECT                                                          00020818
         STM   R14,R12,12(R13)                                          00021018
         BASR  R12,0                                                    00021118
         USING *,R12                                                    00021218
         B     SKIP                                                     00021318
FLD      DS    FD                                                       00021418
DEBUG    DCB   DDNAME=DEBUG,DSORG=PS,MACRF=(PM)                         00021519
SKIP     EQU   *                                                        00021618
         LR    R3,R1                                                    00021718
         WTO   'ESPIE'                                                  00021819
*        USING SDWA,R3                                                  00021919
         LA    R11,DEBUG                                                00022019
         OPEN  ((R11),OUTPUT)                                           00022118
         WTO   'OPENED'                                                 00022218
       MODESET KEY=ZERO,MODE=SUP                                        00022318
         WTO   'SET MODE'                                               00022418
                                                                        00022518
         XR    R4,R4                                                    00022618
         LA    R4,288                                                   00022719
         XR    R8,R8                                                    00022819
         LHI   R8,X'001E'                                               00022919
LP#23    LURAG R5,R4                                                    00023019
         STG   R5,FLD                                                   00023119
         PUT   (R11),FLD                                                00023219
         AHI   R4,X'0008'                                               00023319
         BCT   R8,LP#23                                                 00023419
                                                                        00023519
                                                                        00023619
                                                                        00023718
                                                                        00026718
*        PUT   (R11),SDWANXT1                                           00026819
*        PUT   (R11),SDWAGR02                                           00026919
       MODESET KEY=NZERO,MODE=PROB                                      00027018
         CLOSE ((R11))                                                  00027118
         WTO   'WORK'                                                   00027218
         LM    R14,R12,12(R13)                                          00027318
         SETRP RC=4,RETREGS=YES,WKAREA=(R3),FRESDWA=YES,RETADDR=(R4),  X00027413
               REMREC=YES                                               00027513
         DROP  R3                                                       00027613
         DROP  R12                                                      00027713
                                                                        00027818
         BR    R14                                                      00027913
                                                                        00028013
       IHASDWA                                                          00029013
         END                                                            00030000
