         GENREG                                                         00001000
SAMPLE   CSECT                                                          00010000
         STM   R14,R12,12(R13)                                          00010301
         BASR  R12,0                                                    00010401
         USING *,R12                                                    00010501
         ST    R13,SAVEAREA+4                                           00010602
         LR    R2,R13                                                   00010702
         LA    R13,SAVEAREA                                             00010802
         ST    R13,8(,R2)                                               00010902
                                                                        00011002
OLOLO    ENTRY                                                          00011104
OLOLO    EQU   *                                                        00011205
         WTO   'MODULE3'                                                00011303
                                                                        00011402
                                                                        00011502
                                                                        00011602
                                                                        00011702
                                                                        00011802
                                                                        00011902
                                                                        00012002
                                                                        00012102
                                                                        00012202
                                                                        00012302
                                                                        00012402
                                                                        00012502
                                                                        00012602
         L    R13,SAVEAREA+4                                            00012704
                                                                        00012802
         LM    R14,R12,12(R13)                                          00013000
         BR    R14                                                      00020000
FLD      DS    F                                                        00021001
SAVEAREA DS    18F                                                      00022002
         END                                                            00030000
