         GENREG                                                         00001000
SAMPLE2  CSECT                                                          00010004
         STM   R14,R12,12(R13)                                          00010301
         BASR  R12,0                                                    00010401
         USING *,R12                                                    00010501
         ST    R13,SAVEAREA+4                                           00010602
         LR    R2,R13                                                   00010702
         LA    R13,SAVEAREA                                             00010802
         ST    R13,8(,R2)                                               00010902
                                                                        00011002
         ENTRY OLOLO                                                    00011106
         ENTRY OLOLO2                                                   00011207
OLOLO    EQU   *                                                        00011307
         WTO   'MODULE2'                                                00011407
OLOLO2   EQU   *                                                        00011507
                                                                        00011607
                                                                        00011707
                                                                        00011807
                                                                        00011907
                                                                        00012007
                                                                        00012107
                                                                        00012207
                                                                        00012307
                                                                        00012407
                                                                        00012507
                                                                        00012607
                                                                        00012707
         L     R13,SAVEAREA+4                                           00012807
                                                                        00012907
         LM    R14,R12,12(R13)                                          00013000
         BR    R14                                                      00020000
FLD      DS    F                                                        00021001
SAVEAREA DS    18F                                                      00022002
         END                                                            00030000
