         GENREG                                                         00001000
SAMPLE   CSECT                                                          00010000
         STM   R14,R12,12(R13)                                          00010301
         BASR  R12,0                                                    00010401
         USING *,R12                                                    00010501
         XR    R1,R1                                                    00010601
         ST    R1,FLD                                                   00010701
         B     TEST                                                     00010801
         SVC   8                                                        00011003
         BCTG  R1,0(R2,R3)                                              00011101
         XR    R1,R1                                                    00011201
         BCTG  R1,0(R2,R3)                                              00011301
         XR    R1,R1                                                    00011401
         BCTG  R1,0(R2,R3)                                              00011501
         XR    R1,R1                                                    00011601
         BCTG  R1,0(R2,R3)                                              00011701
         XR    R1,R1                                                    00011801
         BR    R3                                                       00011901
         BALR  R12,0                                                    00012001
TEST     EQU   *                                                        00012101
         LM    R14,R12,12(R13)                                          00013000
         BR    R14                                                      00020000
FLD      DS    F                                                        00021001
SAMPLE2  CSECT                                                          00022002
         STM   R14,R12,12(R13)                                          00023002
         BR    R3                                                       00024002
         LM    R14,R12,12(R13)                                          00025002
         BR    R14                                                      00026002
         END                                                            00030000
