         MACRO                                                          00001017
         SKIPBLOCK &INPUT,&LINE,&SIGN                                   00002017
*SKIPS BLOCK  OF LISTING                                                00002117
         GBLA  &E62                                                     00002217
&E62     SETA  &E62+1                                                   00002317
SKIPLIN&E62 EQU   *                                                     00003017
         GET   &INPUT,&LINE                                             00004017
         CLC   &LINE.(1),&SIGN                                          00004117
         BNE   SKIPLIN&E62                                              00004217
         MEND                                                           00004317
                                                                        00004426
         MACRO                                                          00004526
         GETPTRTOMN &REG                                                00004626
*RETURNS IN REG POINTER TO MODULE NAME OF CRECB                         00004726
         LCLA  &N                                                       00004826
         LCLC  &REGL                                                    00004926
&N       SETA  K'&REG-2                                                 00005026
&REGL    SETC  '&REG'(2,&N)                                             00005126
         L     &REGL,CRECB@                                             00005226
         USING CBHEAD,&REGL                                             00005326
         L     &REGL,ID@                                                00005426
         DROP  &REGL                                                    00005526
*        A     &REGL,TOPM@                                              00005626
*        AHI   &REGL,CBHEAD#                                            00005726
*        AHI   &REGL,X'0002'                                            00005826
         MEND                                                           00005926
                                                                        00006028
         MACRO                                                          00006128
         CMPWITHSPACE &OFFSET=,&BASE=,&RESULT=                          00006229
         GBLA  &LASTLBL                                                 00006329
&LASTLBL SETA  &LASTLBL+1                                               00006429
&OFFST   SETA  &OFFSET                                                  00006528
&N       SETA  K'&BASE-2                                                00006628
&BASEL   SETC  '&BASE'(2,&N)                                            00006728
&N       SETA  K'&BASE-2                                                00006828
&RESULTL SETC  '&RESULT'(2,&N)                                          00006928
.LOOP    ANOP                                                           00007028
         AIF   (&OFFST  LT 0).ENDLOOP                                   00007129
         CLI   &OFFST.(&BASEL.),C' '                                    00007229
         BE    NXT#8&OFFST                                              00007328
&OFFST   SETA  &OFFST+1                                                 00007428
         LA    &RESULTL,&OFFST                                          00007528
         B     CMPS#&LASTLBL                                            00007629
&OFFST   SETA  &OFFST-1                                                 00007728
NXT#8&OFFST EQU   *                                                     00007828
&OFFST   SETA  &OFFST-1                                                 00007928
         AGO   .LOOP                                                    00008028
.ENDLOOP ANOP                                                           00008129
CMPS#&LASTLBL EQU   *                                                   00008229
         MEND                                                           00008328
                                                                        00008417
         GENREG                                                         00008500
         GBLC  &CSECT                                                   00008600
&CSECT   SETC  ''                                                       00009000
                                                                        00029000
MAINLINE CSECT                                                          00029100
MAINLINE AMODE 31                                                       00029214
MAINLINE RMODE 31                                                       00029330
                                                                        00051000
         BASR  R12,0                                                    00060000
         USING *,R12             SET ADDRESSATION                       00070000
                                                                        00070123
       MODESET KEY=ZERO,MODE=SUP                                        00070223
                                                                        00070300
      PROCCALL NAME=GETINIT,(R11)                                       00071000
                                                                        00072023
       MODESET KEY=NZERO,MODE=PROB                                      00073023
         BR    R14                                                      00080200
         LTORG                                                          00080300
         DS    0F                                                       00080400
*=====================================================================  00080500
         COPY  INPARSE                                                  00080600
         COPY  BPARM                                                    00080700
         COPY  DALLOC                                                   00080800
         COPY  DUNALLOC                                                 00080900
         COPY  CNVTOHEX                                                 00081016
         COPY  BLDRECB                                                  00081119
*=====================================================================  00081227
GETINSTR PROCBGN                                                        00081327
*GETS IN R0 ADDR OF CRECB,IN R1 ABENDED ADDR                            00081427
*RETURNS IN R0 ADDR OF ABENDED INSTR IN CRECB                           00081527
         LR    R5,R0                                                    00081627
         LR    R8,R1                                                    00081727
         XR    R6,R6                                                    00081827
         LHI   R6,RECB#         STEP                                    00081927
         USING CBHEAD,R5                                                00082027
         L     R7,POS                                                   00082127
         AR    R7,R5                                                    00082227
         AHI   R7,CBHEADE#-RECB#  END                                   00082329
         DROP  R5                                                       00082527
         AHI   R5,CBHEADE#      COUNTER                                 00082627
         USING RECB,R5                                                  00082827
LP#70    EQU   *                                                        00082927
         LG    R4,OFFSET                                                00083027
         CR    R8,R4                                                    00083127
         BE    CMDFOUND                                                 00083227
         BXLE  R5,R6,LP#70                                              00083327
         WTO   'WARNING! ALIEN BINARY DIED!'                            00083434
*        DC    X'0000'                                                  00083534
         XR    R9,R9                                                    00083633
         B     OUTRES                                                   00083733
CMDFOUND EQU   *                                                        00083827
         LA    R9,INSTR         R9:=ADDR OF INSRT IN RECB               00083927
OUTRES   LR    R0,R9                                                    00084033
         DROP  R5                                                       00084129
GETINSTR PROCEND RC=(R15)                                               00084227
*=====================================================================  00084328
GETRECB  PROCBGN                                                        00084428
*GETS IN R0 USA                                                         00084528
*GETS IN R1 ADDR OF MODULE NAME                                         00084628
*RETURNS IN R0 ADDR OF RECB FOR THE MODULE                              00084728
         LR    R11,R0                                                   00084828
         LR    R10,R1                                                   00084928
         USING USA,R11                                                  00085028
         L     R9,RECB@                                                 00085128
         L     R8,TOPM@                                                 00085228
         DROP  R11                                                      00085328
                                                                        00085428
         USING CBHEAD,R9                                                00085529
         USING TOPM,R7                                                  00085729
LOOP#71  EQU   *                                                        00085828
         LTR   R9,R9             IF POINTER TO RECB 0 THEN ERR0R        00085928
         BE    ERROR                                                    00086028
                                                                        00086128
         L     R7,ID@                                                   00086228
         AR    R7,R8                                                    00086328
         AHI   R7,CBHEAD#        ELSE R7:=POINTER TO TOPMREC            00086428
                                                                        00086528
         CLC   2(8,R7),0(R10)                                           00086928
         BE    ENDLP#71                                                 00087029
                                                                        00087128
         L     R9,NEXT@                                                 00087228
         B     LOOP#71                                                  00087328
ERROR    EQU   *                                                        00087428
         XR    R15,R15                                                  00087528
         LHI   R15,X'0001'                                              00087628
ENDLP#71 EQU   *                                                        00087728
         LR    R0,R9                                                    00087828
         DROP  R9                                                       00087928
         DROP  R7                                                       00088028
GETRECB  PROCEND RC=(R15)                                               00088128
*=====================================================================  00088200
GENRTOPM PROCBGN                                                        00088328
*GETS ON R0 ADDR OF MODULE NAME PADDED WITH BLANKS                      00088428
*RETURNS IN R0 ADDR OF RECORD IN PARM FORMAT                            00088528
         LR    R3,R0                          R3:=ADDR OF MOD NAME      00088628
         XR    R2,R2                          SEEK LENGTH               00088728
  CMPWITHSPACE OFFSET=7,BASE=(R3),RESULT=(R2)                           00088828
       GETMAIN RU,LV=TOPM#,LOC=ANY                                      00089628
         LR    R4,R1                          GOT MEM FOR PARM          00089728
         USING TOPM,R4                                                  00089828
         STH   R2,_PMN                        STORE LENGTH              00089928
         MVC   PMN(8),0(R3)                   STORE NAME                00090028
         LR    R0,R4                          RETURN IN R0              00090128
         DROP  R4                                                       00090228
GENRTOPM PROCEND RC=(R15)                                               00090328
*=====================================================================  00090429
HEXTOCHR PROCBGN                                                        00090529
*GETS IN R0 6-SYMB HEX VALUE                                            00090629
*RETURNS IN R0 POINTER TO BLOCK WITH THE CHAR REPRESENTATION            00090729
         B     SKIP#78                                                  00090829
SCTB4    DC    256X'00'            SCANTAB SET                          00090929
         ORG   SCTB4+X'00'                                              00091029
         DC    X'F0F1F2F3F4F5F6F7F8F9C1C2C3C4C5'                        00091129
         ORG                                                            00091629
SKIP#78  EQU   *                                                        00091929
                                                                        00092029
         LR    R3,R0                                                    00092129
       GETMAIN RU,LV=6,LOC=ANY                                          00092229
         LR    R2,R1                                                    00092329
         LR    R8,R1                                                    00092429
         AHI   R2,X'0005'                                               00092529
                                                                        00092629
         XR    R1,R1                                                    00092729
         LHI   R1,X'0006'                                               00092829
LOOP#78  EQU   *                                                        00092929
         LR    R5,R3                                                    00093029
         NILL  R5,B'0000000000001111'                                   00093129
         STC   R5,0(,R2)                                                00093229
         SRA   R3,4                                                     00093329
         AHI   R2,-1                                                    00093529
         BCT   R1,LOOP#78                                               00093629
         TR    0(6,R8),SCTB4                                            00093829
                                                                        00093929
         LR    R0,R8                                                    00094029
HEXTOCHR PROCEND RC=(R15)                                               00094129
*=====================================================================  00094228
SVTRTBL  PROCBGN                                                        00094328
*GETS USA IN R0                                                         00094428
*PRINT TABLE IN OUTPUT DATASET                                          00094528
         B     SKIP#73                                                  00094628
HEADER1  DC    CL80'DEPARTURE   |DEPARTURE   |DESTINATION |DESTINATION' 00094728
HEADER2  DC    CL80'MODULE      |POINT       |MODULE      |POINT      ' 00094828
LINE     DC    CL80'            |            |            |           ' 00094928
LINEBORD DC    CL80'------------|------------|------------|-----------' 00095028
                                                                        00095128
SKIP#73  EQU   *                                                        00095228
                                                                        00095328
                                                                        00095428
         LR    R11,R0                                                   00095528
         USING USA,R11                                                  00095628
         L     R9,DNCB@                                                 00095728
         AHI   R9,CBHEAD#                                               00095829
         USING DNCB,R9                                                  00095928
                                                                        00096029
                                                                        00096529
         LA    R0,_LIBRARY                                              00096628
         LA    R1,_MEMBER                                               00096728
      PROCCALL NAME=BLDPRM,(R10)                                        00096828
                                                                        00096929
                                                                        00097528
         LR    R8,R0              SAVE PARM IN R3 TO DESTRUCT           00097629
         LA    R1,=C'TRTBL   '                                          00097728
      PROCCALL NAME=DALLOC,(R10)                                        00097828
         LR    R7,R0              SAVE DALLOC STRUCT                    00097929
         DROP  R9                                                       00098029
                                                                        00098129
       PREPDCB PARM=PUT,'TRTBL   ',EODAD=NO,(R9)                        00098230
                                                                        00098330
                                                                        00098429
         LR    R2,R7               R2:=POINTER TO DALLOC STRUCT         00098529
         XR    R4,R4             CREATED DDNAME AND DCB FOR OUT         00098629
         LH    R4,0(,R8)          DESTROY CONC PARM                     00098729
*        LR    R9,R8                                                    00098829
*        L     R6,DEBUG@                                                00098929
*        PUT   (R6),(R9)                                                00099029
*        CLOSE ((R6))                                                   00099129
*        DC    X'0000'                                                  00099229
      FREEMAIN RU,LV=(R4),A=(R8)                                        00099329
                                                                        00099429
       GETMAIN RU,LV=80,LOC=BELOW                                       00099529
         LR    R7,R1                                                    00099629
         MVC   0(80,R7),LINE                                            00099729
                                                                        00100028
         OPEN  ((R9),OUTPUT),MODE=31                                    00100130
         PUT   (R9),HEADER1                                             00100229
         PUT   (R9),HEADER2                                             00100329
         PUT   (R9),LINEBORD                                            00100429
                                                                        00100529
                                                                        00100629
         L     R8,TOPM@                                                 00100729
         AHI   R8,CBHEAD#         R8:=FIRST TOPM                        00100830
         L     R10,TRTBL@                                               00100929
         USING CBHEAD,R10                                               00101029
         USING TRTBL,R3                                                 00101129
         LR    R3,R10                                                   00101229
         AHI   R3,CBHEAD#         SET COUNTER TO START                  00101329
         XR    R4,R4                                                    00101429
         LHI   R4,TRTBL#          SET STEP                              00101529
         L     R5,POS                                                   00101629
         AR    R5,R3                                                    00101729
         SR    R5,R4              SET END                               00101829
*        DC    X'0000'                                                  00101929
LP#53    EQU   *                                                        00102029
         L     R0,ADEP                                                  00104229
      PROCCALL NAME=HEXTOCHR,(R6)                                       00104329
         LR    R6,R0                                                    00104429
         MVC   16(6,R7),0(R6)                                           00104529
      FREEMAIN RU,LV=6,A=(R6)                                           00104629
                                                                        00104729
         L     R0,ADNP                                                  00104829
      PROCCALL NAME=HEXTOCHR,(R6)                                       00104929
         LR    R6,R0                                                    00105029
         MVC   39(6,R7),0(R6)                                           00105129
      FREEMAIN RU,LV=6,A=(R6)                                           00105229
                                                                        00105330
         USING TOPM,R6                                                  00105430
         L     R6,CRMN            R6:=POS     DEPART                    00105530
         AR    R6,R8              R6=TOPMRECORD                         00105630
         MVC   0(8,R7),PMN                                              00106030
         L     R6,CDMN            R6:=POS     DEST                      00106530
         AR    R6,R8              R6=TOPMRECORD                         00106630
         MVC   26(8,R7),PMN                                             00106830
                                                                        00107330
         DROP  R6                                                       00107430
         PUT   (R9),(R7)                                                00107529
         PUT   (R9),LINEBORD                                            00107629
         BXLE  R3,R4,LP#53                                              00107829
                                                                        00107929
         DROP  R3                                                       00108029
         CLOSE ((R9)),MODE=31                                           00108130
      FREEMAIN RU,LV=80,A=(R7)                                          00108229
      FREEMAIN RU,LV=DCBLNGPS,A=(R9)               CRMN     DS    F     00108330
         LR    R0,R2                               ADEP@    DS    FD    00108429
      PROCCALL NAME=DUNALLOC,(R10)                 CDMN     DS    F     00108529
         DROP  R10                                 ADNP     DS    FD    00108629
         DROP  R11                                                      00108729
SVTRTBL  PROCEND RC=(R15)                                               00108829
*=====================================================================  00108929
SPZPGEN  PROCBGN                                                        00109029
*GETS USA IN R0 AND RECB IN R1                                          00109129
*IT IS A TEMP ROUTINE                                                   00109229
*TO GENERATE PARAMS DATASET FOR SUPERZAP SYSIN                          00109329
*RETURNS DDNAME IN R0                                                   00109429
         LR    R11,R0                                                   00109529
         LR    R3,R1                                                    00109629
         USING USA,R11                                                  00109729
                                                                        00109829
         LA    R0,TSPZP                                                 00109929
         LA    R1,TDDSPZP                                               00110029
      PROCCALL NAME=DALLOC,(R10)                                        00110129
                                                                        00110229
         STM   R14,R9,12(R13)                                           00110329
       PREPDCB PARM=PUT,TDDSPZP,(R10)                                   00110429
         LM    R14,R9,12(R13)    DCB ALLOCATION                         00110529
         OPEN  ((R10),OUTPUT),MODE=31                                   00110629
                                                                        00110729
       GETMAIN RU,LV=240,LOC=BELOW                                      00110829
         LR    R9,R1                                                    00110929
         LHI   R1,X'4040'                                               00111029
         STH   R1,0(,R9)                                                00111129
         MVC   1(239,R9),0(R9)                                          00111229
         MVC   0(26,R9),SZ1                                             00111329
         MVC   80(26,R9),SZ2                                            00111429
         MVC   160(26,R9),SZ3                                           00111529
                                                                        00111629
                                                                        00111729
         USING CBHEAD,R3                                                00111829
         L     R7,ID@                                                   00111929
         A     R7,TOPM@                                                 00112029
         AHI   R7,CBHEAD#+2    SET R7 TO TOPM RECORD                    00112129
                                                                        00112229
                                                                        00112329
         LR    R6,R3                                                    00112429
         AHI   R6,CBHEADE#     SET COUNTER TO START                     00112529
         XR    R4,R4                                                    00112629
         LHI   R4,RECB#        SET INCREMENTOR                          00112729
         L     R5,POS                                                   00112829
         AR    R5,R6           SET COMPARE VALUE                        00112929
         AHI   R5,-RECB#                                                00113029
         DROP  R3                                                       00113129
         USING RECB,R6                                                  00113229
LOOP#65  EQU   *                                                        00113329
         CLC   =C'CSECT   ',INSTR                                       00113429
         BNE   SMPLINS1                                                 00113529
         MVC   9(8,R9),0(R7)                                            00113629
         MVC   18(8,R9),OFFSET                                          00113729
         PUT   (R10),(R9)                                               00113829
         MVC   89(6,R9),ROFFSET                                         00113929
         PUT   (R10),80(R9)                                             00114029
         B     ENDIF#65                                                 00114129
SMPLINS1 EQU   *                                                        00114229
         CLC   =X'0A60'(2),INSTR+6         CHECK FOR SVC 60             00114329
         BNE   SMPLINS2                                                 00114429
         MVC   178(4,R9),=C'0AEB'       REPLACE SVC60 BY SVC 235        00114529
         MVC   169(6,R9),ROFFSET                                        00114629
         PUT   (R10),160(R9)                                            00114729
         B     ENDIF#65                                                 00114829
SMPLINS2 EQU   *                                                        00114929
         MVC   178(4,R9),=C'0000'                                       00115029
         MVC   169(6,R9),ROFFSET                                        00115129
         PUT   (R10),160(R9)                                            00115229
ENDIF#65 EQU   *                                                        00115329
         BXLE  R6,R4,LOOP#65                                            00115429
                                                                        00115529
         DROP  R6                                                       00115629
         CLOSE ((R10)),MODE=31                                          00115729
*        PUT   (R10),SZ1         SET SUPERZAP OPSIONS                   00115829
*        PUT   (R10),SZ2                                                00115929
*        PUT   (R10),SZ3                                                00116029
      FREEMAIN R,LV=240,A=(R9)                                          00116129
         B     SKIP#90                                                  00116429
         DS    0F                                                       00116529
TSPZP    DC    X'0015'                                                  00116629
         DC    CL21'EMCPROJ.OUTPUT(SZTBL)'                              00116729
TDDSPZP  DC    CL8'SPZPD   '                                            00116829
*                   XXXX     XXXXXXXX XXXXXXXX                          00116929
SZ1      DC    CL26'NAME     SAMPLE   SAMPLE  '                         00117029
*                   XXXX     XXXXXX                                     00117129
SZ2      DC    CL26'BASE     000000           '                         00117229
*                   XXX      XXXXXX   XX                                00117329
SZ3      DC    CL26'REP      000006   00      '                         00117431
         DS    0F                                                       00117529
SKIP#90  EQU   *                                                        00117629
      FREEMAIN RU,LV=DCBLNGPS,A=(R10)  DESTROY DCB                      00117730
       GETMAIN RU,LV=8,LOC=ANY                                          00117829
         MVC   0(8,R1),TDDSPZP                                          00117929
         LR    R0,R1                                                    00118029
         DROP  R11                                                      00118129
SPZPGEN  PROCEND                                                        00118229
*====================================================================== 00118329
PREPMDL  PROCBGN                                                        00118429
*PREPMDL GETS USA INTO R0, RTOPM INTO R1                                00118529
         LR    R11,R0                                                   00118629
         USING USA,R11             SET ADDRESSABILITY TO USA            00118729
                                                                        00118829
         LR    R5,R1                                                    00118929
                                                                        00119029
         STM   R14,R12,12(R13)                                          00119129
         L     R6,TOPM@                                                 00119229
                                                                        00119329
      PSHSTRCT TOPM,(R5),(R6)                                           00119429
         LM    R14,R12,12(R13)     INSERT RTOPM IN LIST                 00119529
       CRTRECB (R6),RECB@          NOW WE HAVE ADDR OF ADDED RECB IN R6 00119629
         L     R10,TOPM@                                                00119729
         USING CBHEAD,R10                                               00119829
         L     R9,POS                                                   00119929
                                                                        00120029
         AHI   R9,-TOPM#                                                00120129
                                                                        00120229
         DROP  R10                 R9:=ADDR OF LAST MODULE IN TOPM      00120329
         USING CBHEAD,R6                                                00120429
         ST    R9,ID@                                                   00120529
         DROP  R6                  ID@ OF LAST RECB:= R9                00120629
*STAT ANALYSIS TEMPORARY                                                00120729
*        L     R10,RRECB@                                               00120829
*        USING RECB,R10                                                 00120929
*        L     R1,=X'00000006'                                          00121029
*        ST    R1,OFFSET                                                00121129
*        L     R1,=X'47F0C00C'                                          00121229
*        ST    R1,INSTR                                                 00121329
*        DROP  R10                 WE SETTED TEST INSTR TO CHANGE       00121429
*                                                                       00121529
*        STM   R14,R12,12(R13)                                          00121629
*     PSHSTRCT RECB,(R10),(R6)                                          00121729
*        LM    R14,R12,12(R13)     INSERT RTOPM IN LIST                 00121829
*STAT ANALYSIS REAL                                                     00121929
         LR    R0,R11                                                   00122029
         LR    R1,R6                                                    00122129
                                                                        00122229
*        L     R2,DEBUG@                                                00122329
*        ST    R9,FLD                                                   00122429
*        PUT   (R2),FLD                                                 00122529
*        L     R9,TOPM@                                                 00122629
*        PUT   (R2),(R9)                                                00122729
*        L     R9,RECB@                                                 00122829
*        PUT   (R2),(R9)                                                00122929
*        CLOSE ((R2))                                                   00123029
                                                                        00123129
      PROCCALL NAME=BLDRECB,(R10)                                       00123229
*SUPERZAP TABLE GENERATION. AFTER WE HAVE DCB TO TABLE   TEMP: SPZPD    00123329
         LR    R0,R11                                                   00123429
         LR    R1,R6                                                    00123529
      PROCCALL NAME=SPZPGEN,(R10)                                       00123629
*SUPERZAP CALLING. IN R9 WE HAVE ID OF MODULE IN RTOPM                  00123729
         LR    R5,R0               IN R0 WE HAD DDNAME                  00123829
      CRSZPARM TDD,(R5),(R4)                                            00123929
                                                                        00124029
      FREEMAIN RU,LV=8,A=(R5)                                           00124129
         LA    R8,_PDSN                                                 00124229
         WTO   'TEST'                                                   00124329
                                                                        00124429
         B     SKIP#70                                                  00124500
FLD      DS    F                                                        00124618
TDD      DC    CL8'APROG   '                                            00124700
MSG      DS    CL80                                                     00124810
ALIGN    DC    0F                                                       00124910
DDNAMLST DC    XL2'30'                                                  00125010
         DC    XL8'00000000'                                            00125110
         DC    XL8'00000000'                                            00125210
         DC    XL8'00000000'                                            00125310
         DC    CL8'APROG   '                                            00125410
         DC    CL8'SPZPD   '                                            00125510
         DC    XL8'00000000'                                            00125610
SKIP#70  EQU   *                                                        00125700
         LR    R9,R2                                                    00125800
         LR    R0,R8                                                    00125911
         LA    R1,TDD                                                   00126000
      PROCCALL NAME=DALLOC,(R10)                                        00126100
         LR    R10,R0                                                   00126207
         WTO   'DALLOCED'                                               00126300
                                                                        00126400
         LINK  EP=AMASPZAP,PARAM=(0,(R4)),VL=1                          00126510
         XR    R2,R2                      DELETE FORMED PARAM           00126600
         LH    R2,0(,R9)                                                00126700
         AHI   R2,X'0002'                                               00126800
      FREEMAIN RU,LV=(R2),A=(R9)                                        00126900
                                                                        00127000
         WTO   'AP WAS ZAPPED'                                          00127100
         DROP  R11                                                      00127200
         LR    R0,R6    RETURN ADDR OF RECB IN RO                       00127325
PREPMDL  PROCEND                                                        00127400
                                                                        00127500
*====================================================================== 00127600
GETINIT  PROCBGN                                                        00127700
*INIT GETS ADDRESS OF PARM AREA INTO R1                                 00127800
         L     R6,0(,R1)                                                00127900
         NILH  R6,B'0111111111111111'                                   00128000
                                                                        00128117
       GETMAIN RU,LV=USA#,LOC=ANY         CREATE USA                    00128200
         LR    R11,R1                                                   00128300
         USING USA,R11           ESTABLISH ADDRESSABILITY               00128400
         XR    R1,R1                                                    00128528
         ST    R1,TCB@                                                  00128628
         ST    R1,ECBU                                                  00128730
                                                                        00128830
       PREPDCB PARM=PUT,'DEBUG   ',EODAD=NO,(R10)                       00128918
         ST    R10,DEBUG@                                               00129117
*        OPEN  ((R10),OUTPUT)                                           00129231
                                                                        00129330
         XR    R2,R2                                                    00129400
         LHI   R2,TRTBLSZ        CREATE TRTBL                           00129500
         LR    R3,R2                                                    00129600
         AHI   R3,CBHEAD#                                               00129700
       GETMAIN RU,LV=(R3),LOC=ANY                                       00129800
         ST    R1,TRTBL@                                                00129900
         ST    R2,0(,R1)         STORE LENGTH                           00130000
         XR    R2,R2                                                    00130100
         ST    R2,4(R1)          STORE POS                              00130200
                                                                        00130300
         XR    R2,R2             RECB IS CREATED IN CREATERECB          00130400
         ST    R2,RECB@                                                 00130500
                                                                        00130600
         XR    R2,R2                                                    00130700
         LHI   R2,ICBSZ          CREATE ICB                             00130800
         LR    R3,R2                                                    00130900
         AHI   R3,CBHEAD#                                               00131000
       GETMAIN RU,LV=(R3),LOC=ANY                                       00131100
         ST    R1,ICB@                                                  00131200
         ST    R2,0(R1)          STORE LENGTH                           00131300
         XR    R2,R2                                                    00131400
         ST    R2,4(R1)          STORE POS                              00131500
                                                                        00131600
         XR    R2,R2                                                    00131700
         LHI   R2,RSA#           CREATE RSA                             00131800
       GETMAIN RU,LV=(R2),LOC=ANY                                       00131900
         ST    R1,RSA@                                                  00132000
                                                                        00132100
         XR    R2,R2                                                    00132200
         LHI   R2,TRTBLSZ        CREATE TOPM                            00132300
         LR    R3,R2                                                    00132400
         AHI   R3,CBHEAD#                                               00132500
       GETMAIN RU,LV=(R3),LOC=ANY                                       00132600
         ST    R1,TOPM@                                                 00132700
         ST    R2,0(R1)          STORE LENGTH                           00132800
         XR    R2,R2                                                    00132900
         ST    R2,4(R1)          STORE POS                              00133000
                                                                        00133100
         XR    R2,R2                                                    00133200
         LHI   R2,DNCBSZ         CREATE DNCB                            00133304
         LR    R3,R2                                                    00133400
         AHI   R3,CBHEAD#                                               00133500
       GETMAIN RU,LV=(R3),LOC=ANY                                       00133600
         ST    R1,DNCB@                                                 00133704
         ST    R2,0(R1)          STORE LENGTH                           00133800
         XR    R2,R2                                                    00133900
         ST    R2,4(R1)          STORE POS                              00134000
                                                                        00134100
         XR    R2,R2                                                    00134228
         LHI   R2,TRTBL#         CREATE TOPM RECORD                     00134328
       GETMAIN RU,LV=(R2),LOC=ANY                                       00134428
         ST    R1,RTRTBL@                                               00134529
                                                                        00134628
         XR    R2,R2                                                    00134700
         LHI   R2,TOPM#          CREATE TOPM RECORD                     00134800
       GETMAIN RU,LV=(R2),LOC=ANY                                       00134900
         ST    R1,RTOPM@                                                00135000
                                                                        00135100
         XR    R2,R2                                                    00135200
         LHI   R2,RECB#          CREATE RECB RECORD                     00135300
       GETMAIN RU,LV=(R2),LOC=ANY                                       00135400
         ST    R1,RRECB@                                                00135500
                                                                        00135600
         XR    R2,R2                                                    00135700
         LHI   R2,ICB#           CREATE ICB  RECORD                     00135800
       GETMAIN RU,LV=(R2),LOC=ANY                                       00135900
         ST    R1,RICB@                                                 00136000
                                                                        00136100
         XR    R2,R2                                                    00136200
         LHI   R2,DNCB#          CREATE DNCB   RECORD                   00136304
       GETMAIN RU,LV=(R2),LOC=ANY                                       00136400
         ST    R1,RDNCB@                                                00136504
*HERE WILL BE READER OF INSTRUCTIONS FROM DCB INTO ICB INSTEAD OF THIS: 00136600
                                                                        00136700
         B     DATA#1                                                   00136800
         DS    0F                                                       00136900
T1       DC    CL8'HOLA1   '                                            00137000
T2       DC    CL8'LOLKA   '                                            00137100
         DC    X'0005'                                                  00137200
T3       DC    CL8'DTESTTTT'                                            00137300
T4       DC    X'0015'                                                  00137400
         DC    CL21'EMCPROJ.OUTPUT(DEBUG)'                              00137500
TEMPFLD  DS    F                                                        00137629
         DS    0F                                                       00137700
         DS    0F                                                       00137800
DATA#1   EQU   *                                                        00137900
                                                                        00138000
         LR    R0,R11            PARSE SYSIN                            00138130
      PROCCALL NAME=INPARSE,(R10)                                       00138230
         LR    R5,R0             HERE TOPM OF OUR MODULE                00138330
                                                                        00138430
         LR    R1,R0             PREPARE MAIN MODULE                    00138530
         LR    R0,R11                                                   00138630
      PROCCALL NAME=PREPMDL,(R10)                                       00138731
         ST    R0,CRECB@                                                00138830
*        ESTAE MYESTAE,CT,XCTL=YES,PARAM=(R11)                          00138931
         USING TOPM,R5                                                  00139130
         LA    R8,PMN                                                   00139230
         LA    R7,ECBU                                                  00139330
*        L     R9,DEBUG@                                                00139430
*        PUT   (R9),(R8)                                                00139530
*        CLOSE ((R9))                                                   00139630
*        LA    R8,=C'MODULE2 '                                          00139731
*      ATTACHX EPLOC=(R8),SM=PROB,KEY=PROP,ECB=(R7)                     00139831
       ATTACHX EPLOC=(R8),SM=PROB,KEY=PROP,ESTAI=(NUCL,(R11)),ECB=(R7)  00139931
         ST    R1,TCB@                                                  00140131
*        LR    R2,R1          TCB                                       00140231
*        L     R9,DEBUG@                                                00140331
*        PUT   (R9),(R2)                                                00140431
*        L     R2,0(,R2)      RB                                        00140531
*        PUT   (R9),(R2)                                                00140631
*        L     R2,12(,R2)     CDE                                       00140731
*        PUT   (R9),(R2)                                                00140831
*        CLOSE ((R9))                                                   00140931
                                                                        00141031
*        WTO   'OI'                                                     00141131
*        CLOSE ((R9))                                                   00141231
*        WTO   'RE                                                      00141331
*        PUT   (R9),(R2)                                                00141431
*        WTO   'RE2                                                     00141531
*        CLOSE ((R9))                                                   00141631
*        WTO   'WE'                                                     00141731
*        WTO   'DCBED'                                                  00141831
NXTWAIT  EQU   *                                                        00141931
         XR    R1,R1                                                    00142031
         ST    R1,ECBU                                                  00142131
         WAIT  ECB=ECBU                                                 00142231
         NI    ECBU,B'01000000'                                         00142334
         LT    R1,ECBU                                                  00142431
         BE    NXTWAIT                                                  00142534
                                                                        00142731
         L     R9,DEBUG@                                                00142834
         OPEN  ((R9),OUTPUT)                                            00142934
         L     R8,TRTBL@                                                00143034
         PUT   (R9),(R8)                                                00143134
         CLOSE ((R9))                                                   00143234
                                                                        00143334
         WTO   'WAITED'                                                 00143431
         LR    R0,R11            PRINT TRACE TABLE                      00143530
      PROCCALL NAME=SVTRTBL,(R10)                                       00143630
         DROP  R5                                                       00143730
         WTO   'PRINTED'                                                00143834
      FREEMAIN RU,LV=TOPM#,A=(R5)                                       00143930
         DROP  R11                                                      00144030
*HERE WE WILL PREPARE MODULE TO PROCESSING                              00144100
*SPZPGENTEST======================                                      00144200
*     PROCCALL NAME=SPZPGEN,(R10)                                       00144300
*        LR    R5,R0                                                    00144400
*        OPEN  (DEBUG,OUTPUT)                                           00144500
*        PUT   DEBUG,(R5)                                               00144600
*        CLOSE (DEBUG)                                                  00144700
*DYNAMICALLOCATIONTEST============                                      00144800
*        LA    R0,T4                                                    00144900
*        LA    R1,T3                                                    00145000
*     PROCCALL NAME=DALLOC,(R10)                                        00145100
*        LR    R5,R0                                                    00145200
*        OPEN  (DEBUG,OUTPUT)                                           00145300
*        PUT   DEBUG,T1                                                 00145400
*        CLOSE (DEBUG)                                                  00145500
*        LR    R0,R5                                                    00145600
*     PROCCALL NAME=DUNALLOC,(R10)                                      00145700
*CRSZTESTTEST=====================                                      00145800
*     CRSZPARM 'TYTYTYTY',T2,(R9)                                       00145900
*        OPEN  (DEBUG,OUTPUT)                                           00146000
*        PUT   DEBUG,(R9)                                               00146100
*        CLOSE (DEBUG)                                                  00146200
*CREATERECBTEST===================                                      00146300
*        OPEN  (DEBUG,OUTPUT)                                           00146400
*        WTO   'BEFORE RECB'                                            00146500
*        XR    R10,R10                                                  00146600
*   CREATERECB (R7),(R10)                                               00146700
*   CREATERECB (R7),(R10)                                               00146800
*   CREATERECB (R7),(R10)                                               00146900
*        USING CBHEAD,R10                                               00147000
*        LR    R6,R10                                                   00147100
*        PUT   DEBUG,(R6)                                               00147200
*        L     R6,NEXT@                                                 00147300
*        PUT   DEBUG,(R6)                                               00147400
*        L     R6,NEXT@                                                 00147500
*        PUT   DEBUG,(R6)                                               00147600
*        CLOSE (DEBUG)                                                  00147700
*        DROP  R6                                                       00147800
*==================================                                     00147900
*COMMENTED PART                                                         00148000
*GETPTRTOMN TEST                                                        00148129
*        L     R9,DEBUG@                                                00148229
*        LR    R3,R0                                                    00148329
*        PUT   (R9),(R3)                                                00148429
*   GETPTRTOMN (R4)                                                     00148529
*        ST    R4,TEMPFLD                                               00148629
*        PUT   (R9),TEMPFLD                                             00148729
*        CLOSE ((R9))                                                   00148829
                                                                        00148929
*GETINSTR TEST                                                          00149029
*        L     R9,DEBUG@                                                00149129
*        L     R0,CRECB@                                                00149229
*        L     R1,=X'0000004A'                                          00149329
*     PROCCALL NAME=GETINSTR,(R10)                                      00149429
*        LR    R5,R0                                                    00149529
*        L     R8,CRECB@                                                00149629
*        PUT   (R9),(R8)                                                00149729
*        PUT   (R9),(R5)                                                00149829
*        CLOSE ((R9))                                                   00149929
                                                                        00150029
*GETRECB TEST                                                           00150129
*        L     R5,RTOPM@                                                00150229
*        L     R6,TOPM@                                                 00150329
*        USING TOPM,R5                                                  00150429
*        MVC   _PMN(2),=X'05'                                           00150529
*        MVC   PMN(8),=C'TEST1   '                                      00150629
*        DROP  R5                                                       00150729
*        STM   R14,R12,12(R13)                                          00150829
*     PSHSTRCT TOPM,(R5),(R6)                                           00150929
*        LM    R14,R12,12(R13)                                          00151029
*        STM   R1,R6,12(R13)                                            00151129
*      CRTRECB (R7),RECB@                                               00151229
*        LM    R1,R6,12(R13)                                            00151329
*        USING CBHEAD,R6                                                00151429
*        L     R3,POS                                                   00151529
*        AHI   R3,-TOPM#                                                00151629
*        DROP  R6                                                       00151729
*        USING CBHEAD,R7                                                00151829
*        ST    R3,ID@                                                   00151929
*        DROP  R7                                                       00152029
*        LR    R8,R7                                                    00152129
*                                                                       00152229
*        USING TOPM,R5                                                  00152329
*        MVC   _PMN(2),=X'05'                                           00152429
*        MVC   PMN(8),=C'TEST2   '                                      00152529
*        DROP  R5                                                       00152629
*        STM   R14,R12,12(R13)                                          00152729
*     PSHSTRCT TOPM,(R5),(R6)                                           00152829
*        LM    R14,R12,12(R13)                                          00152929
*        STM   R1,R6,12(R13)                                            00153029
*      CRTRECB (R7),RECB@                                               00153129
*        LM    R1,R6,12(R13)                                            00153229
*        USING CBHEAD,R6                                                00153329
*        L     R3,POS                                                   00153429
*        AHI   R3,-TOPM#                                                00153529
*        DROP  R6                                                       00153629
*        USING CBHEAD,R7                                                00153729
*        ST    R3,ID@                                                   00153829
*        DROP  R7                                                       00153929
*        LR    R8,R7               SAVE RECB ADDR IN R8                 00154029
*                                                                       00154129
*        USING TOPM,R5                                                  00154229
*        MVC   _PMN(2),=X'05'                                           00154329
*        MVC   PMN(8),=C'TEST3   '                                      00154429
*        DROP  R5                                                       00154529
*        STM   R14,R12,12(R13)                                          00154629
*     PSHSTRCT TOPM,(R5),(R6)                                           00154729
*        LM    R14,R12,12(R13)                                          00154829
*        STM   R1,R6,12(R13)                                            00154929
*      CRTRECB (R7),RECB@                                               00155029
*        LM    R1,R6,12(R13)                                            00155129
*        USING CBHEAD,R6                                                00155229
*        L     R3,POS                                                   00155329
*        AHI   R3,-TOPM#                                                00155429
*        DROP  R6                                                       00155529
*        USING CBHEAD,R7                                                00155629
*        ST    R3,ID@                                                   00155729
*        DROP  R7                                                       00155829
*        LR    R8,R7               SAVE RECB ADDR IN R8                 00155929
*        L     R8,CRECB@                                                00156029
*                                                                       00156129
*        LR    R0,R11                                                   00156229
*        LA    R1,=C'SAMPLE  '                                          00156329
*     PROCCALL NAME=GETRECB,(R10)  PROCBGN                              00156429
*        LR    R3,R0                                                    00156529
*        L     R9,DEBUG@                                                00156629
*        PUT   (R9),(R8)                                                00156729
*        PUT   (R9),(R3)                                                00156829
*        CLOSE ((R9))                                                   00156929
                                                                        00157029
*GENRTOPM TEST                                                          00157129
*        LA    R0,=C'OLOLOLOL'                                          00157229
*     PROCCALL NAME=GENRTOPM,(R10)                                      00157329
*        L     R9,DEBUG@                                                00157429
*        LR    R3,R0                                                    00157529
*        PUT   (R9),(R3)                                                00157629
*        CLOSE ((R9))                                                   00157729
                                                                        00157829
*HEXTOCHR TEST                                                          00157929
*        L     R0,=X'00000001'                                          00158029
*     PROCCALL NAME=HEXTOCHR,(R10) PROCBGN                              00158129
*        L     R9,DEBUG@                                                00158229
*        LR    R3,R0                                                    00158329
*        PUT   (R9),(R3)                                                00158429
*        CLOSE ((R9))                                                   00158529
                                                                        00158629
*SVTRTBL TEST                                                           00158729
*        L     R5,RTOPM@                                                00158830
*        L     R6,TOPM@                                                 00158930
*        USING TOPM,R5                                                  00159030
*        MVC   _PMN(2),=X'05'                                           00159130
*        MVC   PMN(8),=C'TEST1   '                                      00159230
*        DROP  R5                                                       00159330
*        STM   R14,R12,12(R13)                                          00159430
*     PSHSTRCT TOPM,(R5),(R6)                                           00159530
*        LM    R14,R12,12(R13)                                          00159630
*                                                                       00160030
*        USING TOPM,R5                                                  00160130
*        MVC   _PMN(2),=X'05'                                           00160230
*        MVC   PMN(8),=C'TEST2   '                                      00160330
*        DROP  R5                                                       00160430
*        STM   R14,R12,12(R13)                                          00160530
*     PSHSTRCT TOPM,(R5),(R6)                                           00160630
*        LM    R14,R12,12(R13)                                          00160730
*                                                                       00161930
*        USING TOPM,R5                                                  00162030
*        MVC   _PMN(2),=X'05'                                           00162130
*        MVC   PMN(8),=C'TEST3   '                                      00162230
*        DROP  R5                                                       00162330
*        STM   R14,R12,12(R13)                                          00162430
*     PSHSTRCT TOPM,(R5),(R6)                                           00162530
*        LM    R14,R12,12(R13)                                          00162630
*                                                                       00163830
*        XR    R7,R7                                                    00163930
*        L     R6,TRTBL@                                                00164030
*        L     R5,RTRTBL@                                               00164130
*        USING TRTBL,R5                                                 00164230
*        MVC   ADEP(8),=X'0000444400000000'                             00164330
*        MVC   ADNP(8),=X'0000555500000000'                             00164430
*        ST    R7,CRMN                                                  00164530
*        AHI   R7,TOPM#                                                 00164630
*        ST    R7,CDMN                                                  00164730
*        STM   R14,R12,12(R13)                                          00164830
*     PSHSTRCT TRTBL,(R5),(R6)                                          00164930
*        LM    R14,R12,12(R13)                                          00165030
*                                                                       00165130
*        L     R6,TRTBL@                                                00165330
*        L     R5,RTRTBL@                                               00165430
*        USING TRTBL,R5                                                 00165530
*        MVC   ADEP(8),=X'0000222200000000'                             00165630
*        MVC   ADNP(8),=X'0000333300000000'                             00165730
*        ST    R7,CRMN                                                  00165830
*        AHI   R7,TOPM#                                                 00165930
*        ST    R7,CDMN                                                  00166030
*        STM   R14,R12,12(R13)                                          00166130
*     PSHSTRCT TRTBL,(R5),(R6)                                          00166230
*        LM    R14,R12,12(R13)                                          00166330
*                                                                       00166430
*        L     R6,TRTBL@                                                00166630
*        L     R5,RTRTBL@                                               00166730
*        USING TRTBL,R5                                                 00166830
*        MVC   ADEP(8),=X'0000777700000000'                             00166930
*        MVC   ADNP(8),=X'0000888800000000'                             00167030
*        ST    R7,CRMN                                                  00167130
*        AHI   R7,TOPM#                                                 00167230
*        ST    R7,CDMN                                                  00167330
*        STM   R14,R12,12(R13)                                          00167430
*     PSHSTRCT TRTBL,(R5),(R6)                                          00167530
*        LM    R14,R12,12(R13)                                          00167630
*                                                                       00167730
*        L     R9,DEBUG@                                                00167830
*        L     R8,TRTBL@                                                00167930
*        PUT   (R9),(R8)                                                00168030
*        CLOSE ((R9))                                                   00168129
*                                                                       00168230
*        LR    R0,R11                                                   00168330
*     PROCCALL NAME=SVTRTBL,(R10)                                       00168430
                                                                        00169129
GETINIT  PROCEND RC=(R15)                                               00170429
*====================================================================== 00170529
NUCL     CSECT                                                          00170629
NUCL     AMODE 31                                                       00170730
NUCL     RMODE 24                                                       00170830
*        STM   R14,R12,13(R13)                                          00170931
         BASR  R12,0                                                    00171131
         USING *,R12                                                    00171231
         LR    R3,R1                                                    00171529
         USING SDWA,R3                                                  00171629
         L     R11,SDWAPARM                                             00171729
         USING USA,R11                                                  00171829
*        WTO   'ESTAE'                                                  00171931
         XR    R1,R1                                                    00172030
         L     R1,TCB@                                                  00172131
WAITTCB  LTR   R1,R1                                                    00172229
         L     R1,TCB@                                                  00172331
         BE    WAITTCB                                                  00172429
*DEP CHECKING=========================================                  00172534
         L     R8,SDWANXT1      R8:=ADDR OF ABEND                       00174129
         NILH  R8,B'0111111111111111' BACAUSE OF 31 BIT ADDR            00174431
         BCTR  R8,0                                                     00174531
         BCTR  R8,0             R8:=R8-2;                               00174631
                                                                        00174734
                                                                        00175734
         L     R4,TCB@          LET'S CHECK RB LIST FOR OUR CAMEL       00175834
         L     R4,0(,R4)        GOT RB IN R4 FOR MAIN MODULE            00176031
                                                                        00177131
LOOP#40  LTR   R4,R4            IF RB=0 THEN END                        00177231
         BE    LLE#1                                                    00177331
         L     R5,12(,R4)                                               00177431
         NILH  R5,X'00FF'                                               00177531
         LTR   R5,R5                                                    00177632
         BE    NO#40                                                    00177732
         LTR   R5,R5            IF CDE IS NOT EXIST THEN NEXT RB        00177831
         BE    NO#40                                                    00177931
         LB    R6,29(,R5)                                               00178031
         NILL  R6,B'0000000000100000'                                   00178132
         CHI   R6,B'0000000000000000' CHECK FOR XL                      00178231
         BE    LPDE2                                                    00178331
CDE2     EQU   *                                                        00178431
         L     R6,20(,R5)                                               00178531
         C     R6,=X'40404040'                                          00178631
         BNE   OLOLOP                                                   00178731
         WTO   'INCORRECT SDWANXT1'                                     00180732
OLOLOP   EQU   *                                                        00181232
*        NILH  R6,X'00FF'                                               00181333
         L     R7,12(,R6)    R7=ADDR OF MODULE IN MEMORY                00181532
         L     R9,8(,R6)        R9:=SIZE OF MODULE                      00181632
         NILH  R9,B'0111111111111111'                                   00181732
                                                                        00181832
         B     ENDIF#40                                                 00181932
LPDE2    EQU   *                                                        00182032
         WTO   'NOXL'                                                   00182132
         DC    X'0000'                                                  00182233
         L     R7,36(,R5)    R7=ADDR OF MODULE IN MEMORY                00182332
         L     R9,32(,R5)       R9:=SIZE OF MODULE                      00182432
ENDIF#40 EQU   *                                                        00182532
         AR    R9,R7            HAVE IN R9 BORDER IN MEM                00183032
                                                                        00183132
         CR    R8,R7            IF R8<R7 THEN NO                        00183232
         BL    NO#40                                                    00183332
         CR    R8,R9            IF R8>=R9 THEN NO                       00183432
         BH    NO#40                                                    00183532
         BE    NO#40                                                    00183632
         SR    R8,R7            R8:=OFFSET                              00183732
         B     ENDLP#39                                                 00183832
NO#40    EQU   *                                                        00183932
         LR    R0,R4                                                    00184032
         LB    R7,11(,R4)                                               00184132
         NILL  R7,B'10000000'                                           00184232
         BNE   LLE#1            AFTER R7<>0                             00184332
         L     R4,28(,R4)       NEXT RB                                 00184432
         NILH  R4,X'00FF'                                               00184532
         B     LOOP#40                                                  00184632
                                                                        00184732
LLE#1    L     R4,TCB@          CHECK LLE CHAIN  FOR CAMEL              00184832
         L     R4,36(,R4)       GOT LLE IN R4                           00184932
LP#39    EQU   *                LET'S FIND ABENDED INSTR OFFSET         00185032
         L     R5,4(,R4)        GOT CDE/LPDE IN R5                      00185132
         LTR   R5,R5                                                    00185232
         BE    ENDLP#39                                                 00185332
         IC    R6,29(,R5)                                               00185433
         NILL  R6,B'0000000000100000'                                   00185532
         CHI   R6,B'0000000000000000' CHECK FOR CDE                     00185632
         BE    LPDE1                                                    00185732
CDE1     EQU   *                                                        00185832
         L     R6,20(,R5)       GOT XL                                  00185932
                                                                        00186033
*        NILH  R6,X'00FF'                                               00186132
         L     R7,12(,R6)    R7=ADDR OF MODULE IN MEMORY                00186232
         L     R9,8(,R6)        R9:=SIZE OF MODULE                      00186332
         NILH  R9,B'0111111111111111'                                   00186432
*        L     R9,DEBUG@                                                00186532
*        OPEN  ((R9),OUTPUT)                                            00186632
*        PUT   (R9),(R8)                                                00186732
*        CLOSE ((R9))                                                   00187132
*        DC    X'0000'                                                  00187232
         B     ENDIF#39                                                 00187332
LPDE1    EQU   *                                                        00187432
         L     R7,36(,R5)    R7=ADDR OF MODULE IN MEMORY                00187532
         L     R9,32(,R5)       R9:=SIZE OF MODULE                      00187632
ENDIF#39 EQU   *                                                        00187732
         AR    R9,R7            HAVE IN R9 BORDER IN MEM                00187832
         WTO   'QUEUE'                                                  00187932
         CR    R8,R7            IF R8<R7 THEN NO                        00188132
         BL    NO#39                                                    00188232
         CR    R8,R9            IF R8>R9 THEN NO                        00188332
         BH    NO#39                                                    00188432
         BE    NO#39                                                    00188532
         SR    R8,R7            R8:=OFFSET                              00188632
         B     ENDLP#39                                                 00188832
                                                                        00188932
NO#39    EQU   *                                                        00189032
         L     R4,0(,R4)        GOT NEXT LLE IN R4                      00189132
         LTR   R4,R4                                                    00189232
         BE    ENDLP#39         IF 0 THEN GOTO ENDLP#69                 00189332
                                                                        00189432
         B     LP#39                                                    00189532
                                                                        00189632
ENDLP#39 EQU   *                                                        00189732
         WTO   'MAIN'                                                   00189832
*LET FIND THE INSTR IN RECB(LATER REPLACE WITH DIHITOMY) GOT ADDR IN R0 00189932
         ST    R8,SDWASR08                                              00190034
         L     R0,CRECB@                                                00190132
         LR    R1,R8                                                    00190232
      PROCCALL NAME=GETINSTR,(R10)                                      00190332
         LR    R9,R0                                                    00190432
         CLC   6(1,R9),=X'07'      CHECK FOR BCR                        00190632
         BNE   NXTCMD1                                                  00190732
                                                                        00190832
         LH    R8,6(R9)                                                 00192332
         SRA   R8,4                                                     00192432
         CHI   R8,X'007F'                                               00192532
         BNE   NXTCMD1                                                  00192632
*BR=PROCESSING=START==================================================  00192732
         WTO   'BR'                                                     00192832
         XR    R8,R8                                                    00192932
         IC    R8,7(,R9)                                                00193032
         NILL  R8,B'00001111'   FIRST FOUR BITS IS CODE                 00193133
         SLA   R8,2             *4 TO ADDRESS OUR REGISTER              00193233
         L     R8,SDWAGRSV(R8)  R8:=DEST ADDR                           00193333
                                                                        00193433
*        LH    R1,6(,R9)                                                00193533
*        CHI   R1,X'07F2'                                               00193633
*        BNE   SKIP111                                                  00193733
*        WTO   'XL INFO'                                                00193833
*        L     R3,SDWAGR03                                              00193933
*        L     R2,SDWAGR02                                              00194033
*        L     R10,DEBUG@                                               00194133
*        L     R7,4(,R9)                                                00194233
*        OPEN  ((R10),OUTPUT)                                           00194433
*        PUT   (R10),(R5)                                               00194533
*        PUT   (R10),(R6)                                               00194633
*        CLOSE ((R10))                                                  00194733
*        DC    X'0000'                                                  00194833
*KIP111  EQU   *                                                        00194933
                                                                        00195333
                                                                        00195433
*        DROP  R5                                                       00195533
*==================================DEST CHECKING                        00195633
         L     R4,TCB@                                                  00195733
         L     R4,0(,R4)                                                00195833
                                                                        00195933
LOOP#42  LTR   R4,R4            IF RB=0 THEN END                        00196033
         BE    LLE#2                                                    00196133
         L     R5,12(,R4)                                               00196233
         NILH  R5,X'00FF'                                               00196333
         LTR   R5,R5                                                    00196433
         BE    NO#42                                                    00196533
         LTR   R5,R5            IF CDE IS NOT EXIST THEN NEXT RB        00196633
         BE    NO#42                                                    00196733
         LB    R6,29(,R5)                                               00196833
         NILL  R6,B'0000000000100000'                                   00196933
         CHI   R6,B'0000000000000000' CHECK FOR XL                      00197033
         BE    LPDE3                                                    00197133
CDE3     EQU   *                                                        00197233
         L     R6,20(,R5)                                               00197333
*        NILH  R6,X'00FF'                                               00197833
         L     R7,12(,R6)    R7=ADDR OF MODULE IN MEMORY                00197933
         L     R9,8(,R6)        R9:=SIZE OF MODULE                      00198033
         NILH  R9,B'0111111111111111'                                   00198133
*        WTO   'DEST RB CDE'                                            00198233
*        DC    X'0000'                                                  00198333
         B     ENDIF#42                                                 00198433
LPDE3    EQU   *                                                        00198533
         WTO   'NOXL'                                                   00198633
         DC    X'0000'                                                  00198733
         L     R7,36(,R5)    R7=ADDR OF MODULE IN MEMORY                00198833
         L     R9,32(,R5)       R9:=SIZE OF MODULE                      00198933
ENDIF#42 EQU   *                                                        00199033
         AR    R9,R7            HAVE IN R9 BORDER IN MEM                00199133
                                                                        00199233
                                                                        00199333
         CR    R8,R7            IF R8<R7 THEN NO                        00199433
         BL    NO#42                                                    00199533
*        WTO   'L'                                                      00199633
         CR    R8,R9            IF R8>=R9 THEN NO                       00199733
         BH    NO#42                                                    00199833
         BE    NO#42                                                    00199933
*MAKE TRTABLE RECORD                                                    00200033
         L     R10,RTRTBL@                                              00200133
         USING TRTBL,R10                                                00200233
                                                                        00200333
         L     R1,SDWASR08     R8:=ADDR OF ABEND                        00200434
         ST    R1,ADEP        SET START OFFSET                          00200534
                                                                        00201033
    GETPTRTOMN (R15)                                                    00201133
         ST    R15,CRMN       SET START MODULE                          00201233
         WTO   'BR PUSH'                                                00201333
         LR    R4,R8          SAVE DEST ADDR IN R4                      00201433
         SR    R8,R7            R8:=OFFSET                              00201533
         ST    R8,ADNP        SET DEST OFFSET                           00201633
*R7 R9 R1 IS FREE                                                       00201733
         LR    R7,R0           SAVE INSTR IN R7                         00201833
         LR    R0,R11          R0:=USA                                  00201933
         LA    R1,8(,R5)       R1:=DEST MODULE NAME                     00202033
*        LR    R5,R1                                                    00202133
      PROCCALL NAME=GETRECB,(R9)                                        00202233
                                                                        00202333
         LR    R9,R0           GOT RECB IN R9                           00202433
         ST    R9,CRECB@       SWITCH CRECB@                            00202533
         USING CBHEAD,R9                                                00202633
         MVC   CDMN(4),ID@     SET DEST MODULE'S TOPM                   00202733
         DROP  R9                                                       00202834
         DROP  R10                                                      00202934
                                                                        00203034
         STM   R14,R12,12(R13)                                          00203134
         L     R6,TRTBL@                                                00203234
         L     R5,RTRTBL@                                               00203334
      PSHSTRCT TRTBL,(R5),(R6)                                          00203434
         LM    R14,R12,12(R13)     INSERT RTOPM IN LIST                 00203534
                                                                        00203634
         B     ENDLP#69                                                 00203833
NO#42    EQU   *                                                        00203933
         LR    R0,R4                                                    00204033
         LB    R7,11(,R4)                                               00204133
         NILL  R7,B'10000000'                                           00204233
         BNE   LLE#2            AFTER R7<>0                             00204333
         L     R4,28(,R4)       NEXT RB                                 00204433
         NILH  R4,X'00FF'                                               00204533
                                                                        00204634
         B     LOOP#42                                                  00204733
                                                                        00204833
LLE#2    L     R4,TCB@                                                  00204933
         L     R4,36(,R4)       GOT LLE IN R4                           00205033
                                                                        00205133
LP#69    EQU   *                LET'S FIND MODULE FOR DEST ADDR IN R8   00205233
         L     R5,4(,R4)        GOT CDE/LPDE IN R5                      00205333
         LTR   R5,R5                                                    00205433
         BE    ENDLP#69                                                 00205533
*        L     R9,DEBUG@                                                00205633
*        OPEN  ((R9),OUTPUT)                                            00205733
*        PUT   (R9),(R5)                                                00205833
*        CLOSE ((R9))                                                   00205933
         IC    R6,29(,R5)                                               00206033
         NILL  R6,B'0000000000100000'                                   00206133
                                                                        00206233
         CHI   R6,B'0000000000000000' CHECK FOR CDE                     00206333
         BE    LPDE                                                     00206433
CDE      EQU   *                                                        00206533
         L     R6,20(,R5)       GOT XL                                  00206633
*        NILH  R6,X'00FF'                                               00206733
         L     R7,12(,R6)    R7=ADDR OF MODULE IN MEMORY                00206833
         L     R9,8(,R6)        R9:=SIZE OF MODULE                      00206933
         NILH  R9,B'0111111111111111'                                   00207033
*        DC    X'0000'                                                  00207133
*        C     R8,=X'0000C040'                                          00207233
*        BNE   SKIP111                                                  00207333
*        L     R10,DEBUG@                                               00207433
*        L     R7,4(,R9)                                                00207533
*        OPEN  ((R10),OUTPUT)                                           00207633
*        PUT   (R10),(R5)                                               00207733
*        PUT   (R10),(R6)                                               00207833
*        CLOSE ((R10))                                                  00207933
*        WTO   'XL INFO'                                                00208033
*        DC    X'0000'                                                  00208133
*KIP111  EQU   *                                                        00208233
         B     ENDIF#69                                                 00208333
LPDE     EQU   *                                                        00208433
         L     R7,36(,R5)    R7=ADDR OF MODULE IN MEMORY                00208533
         L     R9,32(,R5)       R9:=SIZE OF MODULE                      00208633
                                                                        00208733
*        L     R10,DEBUG@                                               00208833
*        OPEN  ((R10),OUTPUT)                                           00208933
*        PUT   (R10),(R5)                                               00209033
*        PUT   (R10),(R6)                                               00209133
*        CLOSE ((R10))                                                  00209233
                                                                        00209333
ENDIF#69 EQU   *                                                        00209433
         AR    R9,R7            HAVE IN R9 BORDER IN MEM                00209533
                                                                        00209633
                                                                        00209733
         CR    R8,R7            IF R8<R7 THEN NO                        00209833
         BL    NO#69                                                    00209933
*        WTO   'L'                                                      00210033
         CR    R8,R9            IF R8>R9 THEN NO                        00210133
         BH    NO#69                                                    00210233
         BE    NO#69                                                    00210333
*MAKE TRTABLE RECORD                                                    00210433
         L     R10,RTRTBL@                                              00210533
         USING TRTBL,R10                                                00210633
                                                                        00210733
         L     R1,SDWASR08     R8:=ADDR OF ABEND                        00210834
         ST    R1,ADEP        SET START OFFSET                          00211333
                                                                        00211433
    GETPTRTOMN (R15)                                                    00211533
         ST    R15,CRMN       SET START MODULE                          00211633
         WTO   'BR PUSH2'                                               00211734
         LR    R4,R8          SAVE DEST ADDR IN R4                      00211833
         SR    R8,R7            R8:=OFFSET                              00211933
         ST    R8,ADNP        SET DEST OFFSET                           00212033
*R7 R9 R1 IS FREE                                                       00212133
         LR    R7,R0           SAVE INSTR IN R7                         00212233
         LR    R0,R11          R0:=USA                                  00212333
         LA    R1,8(,R5)       R1:=DEST MODULE NAME                     00212433
*        LR    R5,R1                                                    00212533
      PROCCALL NAME=GETRECB,(R9)                                        00212633
                                                                        00212733
         LR    R9,R0           GOT RECB IN R9                           00212833
         ST    R9,CRECB@       SWITCH CRECB@                            00212933
         USING CBHEAD,R9                                                00213033
         MVC   CDMN(4),ID@     SET DEST MODULE'S TOPM                   00213133
         DROP  R9                                                       00213234
         DROP  R10                                                      00213334
                                                                        00213434
         STM   R14,R12,12(R13)                                          00213534
         L     R6,TRTBL@                                                00213634
         L     R5,RTRTBL@                                               00213734
      PSHSTRCT TRTBL,(R5),(R6)                                          00213834
         LM    R14,R12,12(R13)     INSERT RTOPM IN LIST                 00213934
                                                                        00214034
         B     ENDLP#69                                                 00214233
NO#69    EQU   *                                                        00214333
         L     R4,0(,R4)        GOT NEXT LLE IN R4                      00214433
         LTR   R4,R4                                                    00214533
         BE    ENDLP#69         IF 0 THEN GOTO ENDLP#69                 00214633
         B     LP#69                                                    00214733
ENDLP#69 EQU   *                                                        00214833
*        L     R8,SDWANXT1      R8:=ADDR OF ABEND                       00214933
*        NILH  R8,B'0111111111111111' BACAUSE OF 31 BIT ADDR            00215033
*        BCTR  R8,0                                                     00215133
*        BCTR  R8,0             R8:=R8-2;                               00215233
*        DC    X'00000000'                                              00215333
         MVC   SDWASRSV(64),SDWAGRSV                                    00215433
         NILH  R4,B'0111111111111111'                                   00215533
                                                                        00215634
         LTR   R4,R4                  IF NO MODULE FOR OUR DEST         00215734
         BNE   SYSTEM                 LET'S THINK THAT THIS IS          00215834
         LR    R4,R8                  RETRY TO SYSTEM                   00215934
         L     R2,SDWAGR02                                              00216034
*        L     R3,SDWAGR03                                              00216134
*        WTO   'NULL'                                                   00216234
*        DC    X'0000'                                                  00216334
SYSTEM   EQU   *                                                        00216434
*        L     R2,SDWAGR02                                              00216533
*        DC    X'0000'                                                  00216633
         SETRP RC=4,RETREGS=YES,WKAREA=(R3),FRESDWA=YES,RETADDR=(R4)    00216733
                                                                        00216833
*        LM    R14,R12,13(R13)                                          00216933
         BR    R14              RETURN TO PROGRAM                       00217033
*BR=PROCESSING=END====================================================  00217133
NXTCMD1  EQU   *                                                        00217233
         CLC   6(2,R9),=X'0A08'    CHECK FOR SVC 8 - LOAD               00217333
         BNE   NXTCMD2                                                  00217433
*SVC=8=PROCESSING=START===============================================  00217533
         WTO   'SVC8'                                                   00217633
         MVC   SDWASRSV(64),SDWAGRSV                                    00217733
*        MVC   SDWAARSV(64),SDWAARER                                    00217833
         XR    R4,R4                                                    00217933
         OILH  R4,X'8000'                                               00218033
         L     R5,SDWAGR15                                              00218133
*        DC    X'0000'                                                  00218233
         CR    R4,R5            IF R5>R4 THEN LNR ELSE JMP POS#69       00218333
         BL    POS#69                                                   00218433
         LNR   R5,R5                                                    00218533
         WTO   'DE'                                                     00218633
POS#69   EQU   *                                                        00218733
*        L     R9,DEBUG@                                                00218833
*        OPEN  ((R9),OUTPUT)                                            00218933
*        PUT   (R9),(R5)                                                00219033
*        PUT   (R9),(R5)                                                00219133
                                                                        00219233
                                                                        00219333
         LR    R0,R5            R0:=ADDR OF MODULE NAME                 00219433
      PROCCALL NAME=GENRTOPM,(R10)                                      00219533
                                                                        00219633
*        LR    R5,R0                                                    00219733
*        PUT   (R9),(R5)                                                00219833
*        CLOSE ((R9))                                                   00219933
*        DC    X'0000'                                                  00220033
         LR    R1,R0            RTOPM                                   00220133
         LR    R0,R11           USA                                     00220233
      PROCCALL NAME=PREPMDL,(R10)                                       00220333
                                                                        00220433
         L     R0,SDWAGR00                                              00220533
         L     R1,SDWAGR01                                              00220633
         L     R15,SDWAGR15                                             00220733
         SVC   8                                                        00220833
         ST    R0,SDWASR00                                              00220933
         ST    R1,SDWASR01                                              00221033
         ST    R15,SDWASR15                                             00221133
         L     R4,SDWANXT1      R4:=ADDR OF ABEND                       00221233
         NILH  R4,B'0111111111111111' BACAUSE OF 31 BIT ADDR            00221333
         SETRP RC=4,RETREGS=YES,WKAREA=(R3),FRESDWA=YES,RETADDR=(R4)    00221433
                                                                        00221533
*        LM    R14,R12,13(R13)                                          00221633
         BR    R14              RETURN TO PROGRAM                       00221733
*SVC=8=PROCESSING=END=================================================  00221833
NXTCMD2  EQU   *                                                        00221933
         CLC   6(2,R9),=X'0A7A'    CHECK FOR SVC 8 - EXT LOAD AND OTH   00222033
         BNE   ENDCMD                                                   00222133
         L     R15,SDWAGR15                                             00222233
         CHI   R15,X'0009'        EXTERNAL LOAD                         00222333
         BNE   ENDCMD2                                                  00222433
*SVC=122-09=EXT=LOAD=PROCESSING=START=================================  00222533
         WTO   'SVC122'                                                 00222633
         MVC   SDWASRSV(64),SDWAGRSV                                    00222733
         L     R0,SDWAGR01                                              00222833
      PROCCALL NAME=GENRTOPM,(R10)                                      00222933
                                                                        00223033
         LR    R1,R0            RTOPM                                   00223133
         LR    R0,R11           USA                                     00223233
      PROCCALL NAME=PREPMDL,(R10)                                       00223333
                                                                        00223433
         L     R0,SDWAGR00                                              00223533
         L     R1,SDWAGR01                                              00223633
         L     R15,SDWAGR15                                             00223733
         SVC   122                                                      00223833
         ST    R0,SDWASR00                                              00223933
         ST    R1,SDWASR01                                              00224033
         ST    R15,SDWASR15                                             00224133
                                                                        00224233
         L     R4,SDWANXT1      R4:=ADDR OF ABEND                       00224333
         NILH  R4,B'0111111111111111' BACAUSE OF 31 BIT ADDR            00224433
         SETRP RC=4,RETREGS=YES,WKAREA=(R3),FRESDWA=YES,RETADDR=(R4)    00224533
*        LM    R14,R12,13(R13)                                          00224633
         BR    R14              RETURN TO PROGRAM                       00224733
*SVC=122-09=EXT=LOAD=PROCESSING=END===================================  00224833
ENDCMD2  EQU   *                                                        00224933
                                                                        00225033
ENDCMD   EQU   *                                                        00225133
         DROP  R3                                                       00225233
         WTO   'OTHER'                                                  00225333
         B     LTRG                                                     00225433
         LTORG                                                          00225533
         DS    0F                                                       00225633
LTRG     EQU   *                                                        00225733
         DROP  R11                                                      00225833
         DROP  R12                                                      00225933
                                                                        00226033
         SETRP RC=0                                                     00226133
         BR    R14              PERCOLATE                               00226233
*TEMP AREA. HERE IS CONSTANTS FOR BETA VERSION OF PROGRAM               00226333
*LIST OF INTERRUPTED INSTRUCTIONS:SVC6,SVC7,SVC8,BALR,BCR               00226433
                                                                        00226533
*TEMR AREA END                                                          00226633
                                                                        00226733
                                                                        00226833
CBHEAD   DSECT                                                          00226933
LENGTH   DS    F             LENGTH OF RECORDS                          00227033
POS      DS    F             POSITION FOR INSERTING OF RECORDS          00227133
CBHEAD#  EQU   *-LENGTH      EXTENDED HEADER                            00227233
NEXT@    DS    F             NEXT CB                                    00227333
ID@      DS    F             ID OF CURRENT MODULE(ADDR IN TOPM)         00227433
CBHEADE# EQU   *-LENGTH                                                 00227533
                                                                        00227633
TRTBL    DSECT                                                          00227733
*HEADER                                                                 00227833
*TRACE TABLE                                                            00227933
CRMN     DS    F             ADDR OF CURRENT MODULE IN TOPM             00228033
ADEP     DS    FD            ADDR OF DEP POINT                          00228133
CDMN     DS    F             ADDR OF DESTINATION MODULE IN TOPM         00228233
ADNP     DS    FD            ADDR OF DEST POINT                         00228333
TRTBL#   EQU   *-CRMN                                                   00228433
                                                                        00228533
RSA      DSECT                                                          00228633
*RETRY SUPPLY AREA                                                      00228733
PSW      DS    CL16          PSW                                        00228833
SAVEAREA DS    CL144         SAVEAREA                                   00228933
OLDREG   DS    CL144         REGISTERS FOR RESTORE                      00229033
RSA#     EQU   *-PSW                                                    00229133
                                                                        00229233
USA      DSECT                                                          00229333
*USER SUPPLIED AREA                                                     00229433
TOPM@    DS    F                                                        00229533
RTOPM@   DS    F                                                        00229600
TRTBL@   DS    F                                                        00229700
RTRTBL@  DS    F                                                        00229828
RECB@    DS    F                                                        00230000
CRECB@   DS    F             CURRENT RECB                               00231020
RRECB@   DS    F                                                        00232000
ICB@     DS    F                                                        00240000
RICB@    DS    F                                                        00250000
RSA@     DS    F                                                        00260000
DNCB@    DS    F                                                        00261004
RDNCB@   DS    F                                                        00270004
RETRY@   DS    F                                                        00271000
TCB@     DS    F                                                        00271125
ECBU     DS    F                                                        00271230
_PDSN    DS    H                  LENGTH OF PDSN                        00271300
PDSN     DS    CL54               PDSN IS LIBRARY FOR BINARIES OF AP    00272000
_LPDSN   DS    H                  LENGTH OF PDSN                        00273000
LPDSN    DS    CL54              LPDSN IS LIBRARY FOR LISTINGS OF AP    00274000
DEBUG@   DS    F                                                        00275017
USA#     EQU   *-TOPM@                                                  00276000
                                                                        00277000
TOPM     DSECT                                                          00280000
*HEADER                                                                 00281000
*TABLE OF PREPARED MODULES                                              00282004
_PMN     DS    H                  LENGTH OF MODULE NAME                 00283000
PMN      DS    CL8                MODULE NAME                           00290000
TOPM#    EQU   *-_PMN                                                   00301000
                                                                        00301100
DNCB     DSECT                                                          00301204
*HEADER                           DATA SET NAME CONTROL BLOCK           00301304
_LIBRARY DS    H                                                        00301400
LIBRARY  DS    CL44               REPRESENTATION OF DATA SET NAME       00301500
_MEMBER  DS    H                                                        00301600
MEMBER   DS    CL8                                                      00301700
DNCB#    EQU   *-_LIBRARY                                               00301804
                                                                        00301900
RECB     DSECT                                                          00320000
*EXTENDED HEADER                                                        00321000
*RESTORE CONTROL BLOCK                                                  00322004
OFFSET   DS    FD                 ALSO HERE WE HAVE CSECT NAME          00340019
INSTR    DS    FD                 IF INSTR=CSECT                        00350019
ROFFSET  DS    FD                                                       00350119
RECB#    EQU   *-OFFSET                                                 00350200
                                                                        00350300
ICB      DSECT                                                          00360000
*HEADER                                                                 00370000
*INSTRUCTION CONTROL BLOCK                                              00371004
IC       DS    CL8                                                      00380015
ICB#     EQU   *-IC                                                     00381000
                                                                        00382000
         LCLA  &SIZE                                                    00383000
&SIZE    SETA  64*RECB#                                                 00384000
RECBSZ   EQU   &SIZE                                                    00385000
                                                                        00385100
&SIZE    SETA  64*ICB#                                                  00385200
ICBSZ    EQU   &SIZE                                                    00386000
                                                                        00386100
&SIZE    SETA  64*TOPM#                                                 00387200
TOPMSZ   EQU   &SIZE                                                    00388000
                                                                        00388100
&SIZE    SETA  64*TRTBL#                                                00388200
TRTBLSZ  EQU   &SIZE                                                    00389000
                                                                        00390000
&SIZE    SETA  64*DNCB#                                                 00400004
DNCBSZ   EQU   &SIZE                                                    00410004
                                                                        00430000
                                                                        00440000
SPZPPRM  DSECT                                                          00441000
DDLIST   DS    0H                                                       00441109
         DS    H                                                        00442009
NA1      DS    XL8                                                      00443010
NA2      DS    XL8                                                      00450010
NA3      DS    XL8                                                      00460010
SYSLIB   DS    XL8                                                      00471010
SYSIN    DS    XL8                                                      00472010
SYSPRINT DS    XL8                                                      00473010
SPZPRM#  EQU   *-DDLIST                                                 00474009
*E1      DCB   DDNAME=KKK,DSORG=PS,MACRF=(PM),DCBE=RE2                  00474110
*E2      DCBE  EODAD=MAINLINE,RMODE31=BUFF                              00475010
         DS    0F                                                       00476000
      IEFZB4D0 ,                                                        00476100
         DS    0F                                                       00476200
      IEFZB4D2 ,                                                        00477000
         DS    0F                                                       00480000
         DCBD  DSORG=(PS),DEVD=(DA)                                     00490000
       IHADCBE                                                          00491000
       IHASDWA                                                          00500029
                                                                        00510017
         END                                                            00590017
