//CCW      JOB
//         JCLLIB ORDER=(DACF.PROCLIB)
//CCWCOMP  EXEC ASMCL,
//  INFILE='CCWPROJ.SRC(CCWR)',OUTFILE='CCWPROJ.LOADLIB(CCWR)',
//  LOPTS='AC=1'
//CCWCOMP  EXEC ASMCL,
//  INFILE='CCWPROJ.SRC(CCW2)',OUTFILE='CCWPROJ.LOADLIB(CCW2)',
//  LOPTS='AC=1,RENT'
//CCWRUN   EXEC PGM=CCWR
//STEPLIB  DD   DSN=CCWPROJ.LOADLIB,DISP=SHR
//DEBUG    DD   DSN=CCWPROJ.OUTPUT(DEBUG),DISP=SHR
//SYSPRINT DD   SYSOUT=*
