//CCWF     JOB
//         JCLLIB ORDER=(DACF.PROCLIB)
//CCWCOMP  EXEC ASMCL,
//  INFILE='CCWPROJ.SRC(CCWRF)',OUTFILE='CCWPROJ.LOADLIB(CCWRF)',
//  LOPTS='AC=1'
//CCWCOMP  EXEC ASMCL,
//  INFILE='CCWPROJ.SRC(CCWF)',OUTFILE='CCWPROJ.LOADLIB(CCWF)',
//  LOPTS='AC=1,RENT'
//CCWRUN   EXEC PGM=CCWRF
//STEPLIB  DD   DSN=CCWPROJ.LOADLIB,DISP=SHR
//DEBUG    DD   DSN=CCWPROJ.OUTPUT(DEBUG),DISP=SHR
//SYSPRINT DD   SYSOUT=*
