//TRTEST   JOB
//         JCLLIB ORDER=(DACF.PROCLIB)
//TRTSTCMP EXEC ASMCL,
//  INFILE='CCWPROJ.SRC(TRTEST)',OUTFILE='CCWPROJ.LOADLIB(TRTEST)',     ,
//  LOPTS='AC=1'
//TRTSTRUN EXEC PGM=TRTEST
//STEPLIB  DD   DSN=CCWPROJ.LOADLIB,DISP=SHR
//DEBUG    DD   DSN=CCWPROJ.OUTPUT(DEBUG2),DISP=SHR
//SYSPRINT DD   SYSOUT=*
