         GENREG                                                         00001000
SAMPLE2  CSECT                                                          00010004
         STM   R14,R12,12(R13)                                          00010301
         BASR  R12,0                                                    00010401
         USING *,R12                                                    00010501
         ST    R13,SAVEAREA+4                                           00010602
         LR    R2,R13                                                   00010702
         LA    R13,SAVEAREA                                             00010802
         ST    R13,8(,R2)                                               00010902
                                                                        00011016
                                                                        00011208
*        LOAD  EP=MODULE3                                               00011318
*        LOAD  EP=MODULE4                                               00011418
INF      B     INF                                                      00011518
*        LA    R2,OLOLO3                                                00011617
*        BR    R2                                                       00011717
*LOLO3   DC    X'0000'                                                  00011812
OLOLO2   EQU   *                                                        00012108
         WTO   'MODULE2'                                                00012210
         WTOR  'ASK 2 TO STOP',REPL,4,ECB                               00012309
         WAIT  ECB=ECB                                                  00012408
                                                                        00013008
         L     R13,SAVEAREA+4                                           00013108
                                                                        00013208
         LM    R14,R12,12(R13)                                          00014000
         BR    R14                                                      00020000
FLD      DS    F                                                        00021001
SAVEAREA DS    18F                                                      00022002
REPL     DS    FD                                                       00023008
ECB      DC    F'0000'                                                  00024008
         END                                                            00030000
