MYPROGR1 CSECT                                                          00010001
         EXTRN MYPROGR2                                                 00012001
         STM   14,12,12(13)                                             00020000
         BALR  RBASE,0                                                  00030000
         USING *,RBASE                                                  00040000
         ST    13,SAVEAREA+4                                            00050000
         LR    2,13                                                     00060000
         LA    13,SAVEAREA                                              00070000
         ST    13,8(,2)                                                 00080000
*---------------------------                                            00090000
         WTO   'START S1'                                               00100000
         L     2,MYPROGR3                                               00101001
*        BR    2                                                        00110001
RET1     EQU   *                                                        00120001
         ENTRY RET1                                                     00121002
         XR    3,3                                                      00122002
         LHI   3,X'0004'                                                00123002
         LR    5,3                                                      00124002
         LA    2,STR1                                                   00130102
         LA    4,STR2                                                   00130202
         WTO   TEXT=(4)                                                 00131002
         XR    0,0                                                      00131101
*        LA    2,2(,2)                                                  00131202
*        MVST  3,2                                                      00132002
         MVCL  4,2        CHANGES R2 AND R4                             00132102
         DC    X'0000'                                                  00132202
*        LA    4,STR2                                                   00132302
*        MVC   0(5,4),0(2)                                              00132402
         WTO   TEXT=(4)                                                 00133002
*        LOAD  EP=S2                                                    00140001
*        LR    3,0                                                      00180001
*        LA    14,END                                                   00200001
*        BR    3                                                        00210001
*ND      EQU   *                                                        00220001
         WTO   'FINISH S1'                                              00230000
*---------------------------                                            00270000
         L     13,SAVEAREA+4                                            00280000
         LM    14,12,12(13)                                             00290000
         XR    15,15                                                    00300000
         BR    14                                                       00310000
*---------------------------                                            00320000
MYPROGR3 DC    A(MYPROGR2)                                              00330001
RBASE    EQU   12                                                       00350000
SAVEAREA DS    18F                                                      00360000
STR1     DC    X'0008'                                                  00361001
         DC    CL7'ABC    '                                             00361101
         DC    X'00'                                                    00361201
STR2     DC    X'0008'                                                  00362001
         DC    CL8'        '                                            00363001
         END                                                            00370000
