         MACRO
         PUTINT &OUT,&INTER,&MEMAREA
         LCLC  &INTER_
         LCLC  &MEMAREA_
         LCLA  &N
&N       SETA  K'&INTER-2
&INTER_  SETC  '&INTER'(2,&N)
&N       SETA  K'&MEMAREA-2
&MEMAREA_ SETC '&MEMAREA'(2,&N)
         XR    R1,R1

         STC   R1,0(&MEMAREA_)
         MVC   1(17,&MEMAREA_),0(&MEMAREA_)
         AIF   ('&INTER'(1,1) EQ '(').REGISTR
         L     R1,&INTER_
         AGO   .CONVERT
.REGISTR LR    R1,&INTER_
.CONVERT ANOP
&INTER_  SETC  'R1'
         CVD   R1,0(,&MEMAREA_)

         UNPK  8(10,&MEMAREA_),0(8,&MEMAREA_)

         OI    17(&MEMAREA_),X'F0'

         PUT   &OUT,8(&MEMAREA_)

         MEND

