//*ASSEMBLER COMPILATION AND LINKING============================
//ASMCL    PROC LINPARM=''
//CP       EXEC ASMC,NAME=&NAME
//LK       EXEC PGM=IEWL,PARM='&LINPARM.'
//SYSLIN   DD   DSN=EMCPROJ.OBJ(&NAME),DISP=SHR
//SYSLMOD  DD   DSN=EMCPROJ.LOADLIB(&NAME),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//         PEND
