//*ASSEMBLER COMPILATION========================================
//ASMC     PROC
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DSN=EMCPROJ.SRC(&NAME),DISP=SHR
//SYSLIN   DD   DSN=EMCPROJ.OBJ(&NAME),DISP=SHR
//SYSLIB   DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//         DD   DSN=SYS1.MODGEN,DISP=SHR
//         DD   DSN=SYS1.MACLIB,DISP=SHR
//*        DD   DSN=DACF.MACLIB,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//SYSADATA DD   SYSOUT=*
//         PEND
