//BPARM    JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DSN=EMCPROJ.SRC(BPARM),DISP=SHR
//SYSLIB   DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//         DD   DSN=SYS1.MACLIB,DISP=SHR
//SYSLIN   DD   DSN=EMCPROJ.OBJ(BPARM),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//BIND     EXEC PGM=HEWL,PARM='EP=TEMPLATE'
//SYSLIN   DD   DSN=EMCPROJ.OBJ(BPARM),DISP=SHR
//SYSLMOD  DD   DSN=EMCPROJ.LOADLIB(BPARM),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//RUN      EXEC PGM=BPARM
//SYSIN    DD   *
BINARY=EMCPROJ.LOADLIB
LISTING=EMCPROJ.INPUT
MAIN=SAMPLE
COMMANDS=LINK,BR,XCTL
COMMANDS=LOAD
OUTPUT=EMCPROJ.OUTPUT(TEMPLATE)
/*
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB(BPARM),DISP=SHR
//DEBUG    DD   DSN=EMCPROJ.OUTPUT(DEBUG),DISP=SHR
//DUMPDD   DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
