//CALLER   JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DISP=SHR,DSN=EMCPROJ.SRC(CALLER)
//SYSLIN   DD   DISP=SHR,DSN=EMCPROJ.OBJ(CALLER)
//SYSLIB   DD   DISP=SHR,DSN=EMCPROJ.MACLIB
//         DD   DISP=SHR,DSN=SYS1.MACLIB
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//LINKING  EXEC PGM=HEWL
//SYSLIN   DD   DISP=SHR,DSN=EMCPROJ.OBJ(CALLER)
//SYSLMOD  DD   DISP=SHR,DSN=EMCPROJ.LOADLIB(CALLER)
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//EXECUTE  EXEC PGM=CALLER,PARM='EFREMOV.LOADLIB(DMODULE1)'
//STEPLIB  DD   DISP=SHR,DSN=EMCPROJ.LOADLIB(CALLER)
//SYSPRINT DD   SYSOUT=*
//OUTSET   DD   DISP=SHR,DSN=EMCPROJ.OUTPUT(DEBUG),LRECL=80,RECFM=FB,
//             BLKSIZE=80,DSORG=PS
//DUMPDD   DD   SYSOUT=*
