//DYNSPZAP JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DSN=EMCPROJ.SRC(DYNSPZAP),DISP=SHR
//SYSLIN   DD   DSN=EMCPROJ.OBJ(DYNSPZAP),DISP=SHR
//SYSLIB   DD   DSN=SYS1.MACLIB,DISP=SHR
//         DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//         DD   DSN=EMCPROJ.COPY,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//BIND     EXEC PGM=HEWL,PARM='EP=MYPROGRM,AMODE=31'
//SYSLIN   DD   DSN=EMCPROJ.OBJ(DYNSPZAP),DISP=SHR
//SYSLMOD  DD   DSN=EMCPROJ.LOADLIB(DYNSPZAP),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//RUN      EXEC PGM=DYNSPZAP
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB,DISP=SHR
//DUMPDD   DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//DEBUG    DD   DSN=EMCPROJ.OUTPUT(DEBUG),DISP=SHR
//OUTSET   DD   DISP=SHR,DSN=EMCPROJ.OUTPUT(DEBUG),
//             DCB=(DSORG=PS,LRECL=80,BLKSIZE=80,RECFM=FB)
//INSET    DD   DISP=SHR,DSN=EMCPROJ.INPUT(DEBUG),
//             DCB=(DSORG=PS,LRECL=80,BLKSIZE=80,RECFM=FB)
