//SAMPLE   JOB
//RUN      EXEC PGM=SAMPLE
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB(SAMPLE),DISP=SHR
//DUMPDD   DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//OUTSET   DD   DISP=SHR,DSN=EMCPROJ.OUTPUT(DEBUG),
//             DCB=(DSORG=PS,LRECL=80,BLKSIZE=80,RECFM=FB)
//INSET    DD   DISP=SHR,DSN=EMCPROJ.INPUT(DEBUG),
//             DCB=(DSORG=PS,LRECL=80,BLKSIZE=80,RECFM=FB)
