//ESTAE    JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DSN=EMCPROJ.SRC(ESTAE),DISP=SHR
//SYSLIN   DD   DSN=EMCPROJ.OBJ(ESTAE),DISP=SHR
//SYSLIB   DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//         DD   DSN=SYS1.MACLIB,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//LINKING  EXEC PGM=HEWL,PARM='AC=1'
//SYSLIN   DD   DSN=EMCPROJ.OBJ(ESTAE),DISP=SHR
//SYSLMOD  DD   DSN=EMCPROJ.LOADLIB(ESTAE),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//STEP     EXEC PGM=ESTAE
//SYSPRINT DD   SYSOUT=*
//DUMPDD   DD   SYSOUT=*
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB,DISP=SHR
//DEBUG    DD   DISP=SHR,DSN=EMCPROJ.OUTPUT(DEBUG)

