//GTFMEM  JOB
//* STARTS GTF
//IEFPROC EXEC PGM=IEFBR14,REGION=32M,                                 *
//          PARM='MODE=EXT,DEBUG=NO,TIME=YES,BLOK=40K,SD=0K,SA=40K'
//IEFRDER DD   DSNAME='EMCPROJ.TRACE.ME2',UNIT=SYSDA,                  *
//         SPACE=(CYL,15),DISP=(NEW,KEEP),VOL=SER=ZAIMS1
