//JCLTEST  JOB
//         SET  DATA='HELLO'
//ASMSTEP  EXEC PROC=ASMACLG
//C.SYSIN  DD   DISP=SHR,DSN=EMCPROJ.SRC(JCLTEST)
//C.SYSLIB DD   DISP=SHR,DSN=SYS1.MACLIB
//G.DEBUG  DD   DISP=SHR,DSN=EMCPROJ.OUTPUT(DEBUG)
//G.MYSYS  DD   *
'&DATA'
/*
