//MACTEST  JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DSN=EMCPROJ.SRC(MACTEST),DISP=SHR
//SYSLIN   DD   DSN=EMCPROJ.OBJ(MACTEST),DISP=SHR
//SYSLIB   DD   DSN=SYS1.MACLIB,DISP=SHR
//         DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//         DD   DSN=EMCPROJ.COPY,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//BIND     EXEC PGM=HEWL,PARM='EP=MYPROGRM,AMODE=31'
//SYSLIN   DD   DSN=EMCPROJ.OBJ(MACTEST),DISP=SHR
//SYSLMOD  DD   DSN=EMCPROJ.LOADLIB(MACTEST),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//RUN      EXEC PGM=MACTEST,PARM='EFREMOV.LOADLIB(DMODULE1),DMODULE1'
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB(MACTEST),DISP=SHR
//DUMPDD   DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//OUTSET   DD   DISP=SHR,DSN=EMCPROJ.OUTPUT(DEBUG),
//             DCB=(DSORG=PS,LRECL=80,BLKSIZE=80,RECFM=FB)
//INSET    DD   DISP=SHR,DSN=EMCPROJ.INPUT(DEBUG),
//             DCB=(DSORG=PS,LRECL=80,BLKSIZE=80,RECFM=FB)
