//SAMPLE   JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DSN=EMCPROJ.SRC(MODULE3),DISP=SHR
//SYSLIN   DD   DSN=EMCPROJ.OBJ(MODULE3),DISP=SHR
//SYSLIB   DD   DSN=SYS1.MACLIB,DISP=SHR
//         DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//SYSPRINT DD   DISP=SHR,DSN=EMCPROJ.LISTING(MODULE3)
//SYSTERM  DD   SYSOUT=*
//BIND     EXEC PGM=HEWL
//SYSLIN   DD   DSN=EMCPROJ.OBJ(MODULE3),DISP=SHR
//SYSLMOD  DD   DSN=EMCPROJ.LOADLIB(MODULE3),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//RUN      EXEC PGM=MODULE3
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB,DISP=SHR
//DUMPDD   DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
//OUTSET   DD   DISP=SHR,DSN=EMCPROJ.OUTPUT(DEBUG),
//             DCB=(DSORG=PS,LRECL=80,BLKSIZE=80,RECFM=FB)
//INSET    DD   DISP=SHR,DSN=EMCPROJ.INPUT(DEBUG),
//             DCB=(DSORG=PS,LRECL=80,BLKSIZE=80,RECFM=FB)
