//CALLER   JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DISP=SHR,DSN=EMCPROJ.SRC(DALLOCTS)
//SYSLIN   DD   DISP=SHR,DSN=EMCPROJ.OBJ(DALLOCTS)
//SYSLIB   DD   DISP=SHR,DSN=EMCPROJ.MACLIB
//         DD   DISP=SHR,DSN=SYS1.MACLIB
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//LINKING  EXEC PGM=HEWL
//SYSLIN   DD   DISP=SHR,DSN=EMCPROJ.OBJ(DALLOCTS)
//SYSLMOD  DD   DISP=SHR,DSN=EMCPROJ.LOADLIB(DALLOCTS)
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//EXECUTE  EXEC PGM=DALLOCTS,PARM='EMCPROJ.OUTPUT(DEBUG)'
//STEPLIB  DD   DISP=SHR,DSN=EMCPROJ.LOADLIB(DALLOCTS)
//SYSPRINT DD   SYSOUT=*
//DUMPDD   DD   SYSOUT=*
