//NOTE     JOB
//RUN      EXEC ASMACLG
//C.SYSLIB DD   DISP=SHR,DSN=SYS1.MACLIB
//         DD   DISP=SHR,DSN=EMCPROJ.MACLIB
//C.SYSIN  DD   DISP=SHR,DSN=EMCPROJ.SRC(NOTE)
//G.DB     DD   DSN=EMCPROJ.VSAM4,DISP=SHR
