//S1       JOB
//COMPILE  EXEC  PGM=ASMA90
//SYSLIB   DD    DISP=SHR,DSN=SYS1.MACLIB
//SYSIN    DD    DISP=SHR,DSN=EMCPROJ.SRC(S1)
//SYSLIN   DD    DISP=SHR,DSN=EMCPROJ.OBJ(S1)
//SYSPRINT DD    SYSOUT=*
//LINK     EXEC  PGM=HEWL
//SYSPRINT DD    SYSOUT=*
//SYSLIN   DD    DISP=SHR,DSN=EMCPROJ.OBJ(S1)
//SYSLMOD  DD    DISP=SHR,DSN=EMCPROJ.LOADLIB(S1)
//RUN      EXEC  PGM=S1
//STEPLIB  DD    DISP=SHR,DSN=EMCPROJ.LOADLIB
//SYSPRINT DD    SYSOUT=*
