//S2       JOB
//COMPILE  EXEC  PGM=ASMA90
//SYSLIB   DD    DISP=SHR,DSN=SYS1.MACLIB
//SYSIN    DD    DISP=SHR,DSN=EMCPROJ.SRC(S2)
//SYSLIN   DD    DISP=SHR,DSN=EMCPROJ.OBJ(S2)
//SYSPRINT DD    SYSOUT=*
//LINK     EXEC  PGM=HEWL
//SYSPRINT DD    SYSOUT=*
//SYSLIN   DD    DISP=SHR,DSN=EMCPROJ.OBJ(S2)
//SYSLMOD  DD    DISP=SHR,DSN=EMCPROJ.LOADLIB(S2)
//RUN      EXEC  PGM=S2
//STEPLIB  DD    DISP=SHR,DSN=EMCPROJ.LOADLIB
//SYSPRINT DD    SYSOUT=*
