//S3       JOB
//COMPILE  EXEC  PGM=ASMA90
//SYSLIB   DD    DISP=SHR,DSN=SYS1.MACLIB
//SYSIN    DD    DISP=SHR,DSN=EMCPROJ.SRC(S3)
//SYSLIN   DD    DISP=SHR,DSN=EMCPROJ.OBJ(S3)
//SYSPRINT DD    DSN=EMCPROJ.LISTING(S3),DISP=SHR
//LINK     EXEC  PGM=HEWL
//SYSPRINT DD    SYSOUT=*
//SYSLIN   DD    DISP=SHR,DSN=EMCPROJ.OBJ(S3)
//SYSLMOD  DD    DISP=SHR,DSN=EMCPROJ.LOADLIB(S3)
//RUN      EXEC  PGM=S3
//STEPLIB  DD    DISP=SHR,DSN=EMCPROJ.LOADLIB
//SYSPRINT DD    SYSOUT=*
