//S4       JOB
//COMPILE  EXEC  PGM=ASMA90
//SYSLIB   DD    DISP=SHR,DSN=SYS1.MACLIB
//SYSIN    DD    DISP=SHR,DSN=EMCPROJ.SRC(S4)
//SYSLIN   DD    DISP=SHR,DSN=EMCPROJ.OBJ(S4)
//SYSPRINT DD    SYSOUT=*
//LINK     EXEC  PGM=HEWL
//SYSPRINT DD    SYSOUT=*
//SYSLIN   DD    DISP=SHR,DSN=EMCPROJ.OBJ(S4)
//SYSLMOD  DD    DISP=SHR,DSN=EMCPROJ.LOADLIB(S4)
//RUN      EXEC  PGM=S4
//STEPLIB  DD    DISP=SHR,DSN=EMCPROJ.LOADLIB
//SYSPRINT DD    SYSOUT=*
