//SPYM     JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DSN=EMCPROJ.SRC(SPYM),DISP=SHR
//SYSLIB   DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//         DD   DSN=SYS1.MACLIB,DISP=SHR
//         DD   DSN=EMCPROJ.COPY,DISP=SHR
//SYSLIN   DD   DSN=EMCPROJ.OBJ(SPYM),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//BIND     EXEC PGM=HEWL,PARM='EP=MAINLINE'
//SYSLIN   DD   DSN=EMCPROJ.OBJ(SPYM),DISP=SHR
//SYSLMOD  DD   DSN=EMCPROJ.LOADLIB(SPYM),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//RUN      EXEC PGM=SPYM
//SYSIN    DD   *
BINARY=EMCPROJ.LOADLIB
LISTING=EMCPROJ.INPUT
MAIN=SAMPLE
COMMANDS=LINK,BR,XCTL
COMMANDS=LOAD
OUTPUT=EMCPROJ.OUTPUT(SPYM)
/*
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB(SPYM),DISP=SHR
//DEBUG    DD   DSN=EMCPROJ.OUTPUT(DEBUG),DISP=SHR
//DUMPDD   DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
