//SPYM     JOB
//RUN      EXEC PGM=SPYM,REGION=200M
//SYSIN    DD   *
BINARY=EMCPROJ.LOADLIB
LISTING=EMCPROJ.INPUT
MAIN=SAMPLE
COMMANDS=LINK,BR,XCTL
COMMANDS=LOAD
OUTPUT=EMCPROJ.OUTPUT(SPYM)
/*
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB(SPYM),DISP=SHR
//DEBUG    DD   DSN=EMCPROJ.OUTPUT(DEBUG),DISP=SHR
//MEMCHECK DD   DSN=EMCPROJ.OUTPUT(MEMCHECK),DISP=SHR
//DUMPDD   DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
