//SPYM     JOB
//RUN      EXEC PGM=SPYM,REGION=200M
//SYSIN    DD   *
BINARY=EMCPROJ.LOADLIB         LIBRARY OF LOAD MODULES
LISTING=EMCPROJ.LISTING        LIBRARY OF LISTINGS FOR LOAD MODULES
MAIN=S1                        NAME OF MAIN MODULE
COMMANDS=BR                    SANDBOXED COMMANDS (INTERSCEPTION)
OUTPUT=EMCPROJ.OUTPUT(SPYM)    OUTPUT DATASET FOR TRACE TABLE
/*
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB(SPYM),DISP=SHR
//DEBUG    DD   DSN=EMCPROJ.OUTPUT(DEBUG),DISP=SHR
//MEMCHECK DD   DSN=EMCPROJ.OUTPUT(MEMCHECK),DISP=SHR
//DUMPDD   DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
