//SVCUPD1   JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DSN=EMCPROJ.SRC(SVCUPD1),DISP=SHR
//SYSLIN   DD   DSN=EMCPROJ.OBJ(SVCUPD1),DISP=SHR
//SYSLIB   DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//         DD   DSN=SYS1.MACLIB,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//LINKING  EXEC PGM=HEWL,PARM='AC=1'
//SYSLIN   DD   DSN=EMCPROJ.OBJ(SVCUPD1),DISP=SHR
//SYSLMOD  DD   DSN=EMCPROJ.LOADLIB(SVCUPD1),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//COMPILE2 EXEC PGM=ASMA90
//SYSIN    DD   DSN=EMCPROJ.SRC(SVC241),DISP=SHR
//SYSLIN   DD   DSN=EMCPROJ.OBJ(SVC241),DISP=SHR
//SYSLIB   DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//         DD   DSN=SYS1.MACLIB,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//LINKING2 EXEC PGM=HEWL,PARM='AC=1,REUS=RENT'
//SYSLIN   DD   DSN=EMCPROJ.OBJ(SVC241),DISP=SHR
//SYSLMOD  DD   DSN=EMCPROJ.LOADLIB(SVC241),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//COMPILE3 EXEC PGM=ASMA90
//SYSIN    DD   DSN=EMCPROJ.SRC(APPRTEST),DISP=SHR
//SYSLIN   DD   DSN=EMCPROJ.OBJ(APPRTEST),DISP=SHR
//SYSLIB   DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//         DD   DSN=SYS1.MACLIB,DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//LINKING3 EXEC PGM=HEWL,PARM='AC=1'
//SYSLIN   DD   DSN=EMCPROJ.OBJ(APPRTEST),DISP=SHR
//SYSLMOD  DD   DSN=EMCPROJ.LOADLIB(APPRTEST),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//STEP     EXEC PGM=SVCUPD1
//SYSPRINT DD   SYSOUT=*
//DUMPDD   DD   SYSOUT=*
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB,DISP=SHR
//DEBUG    DD   DISP=SHR,DSN=EMCPROJ.OUTPUT(DEBUG)
