//SZTEST   JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DISP=SHR,DSN=EMCPROJ.SRC(SZTEST)
//SYSLIN   DD   DISP=SHR,DSN=EMCPROJ.OBJ(SZTEST)
//SYSLIB   DD   DISP=SHR,DSN=EMCPROJ.MACLIB
//         DD   DISP=SHR,DSN=SYS1.MACLIB
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//LINKING  EXEC PGM=HEWL
//SYSLIN   DD   DISP=SHR,DSN=EMCPROJ.OBJ(SZTEST)
//SYSLMOD  DD   DISP=SHR,DSN=EMCPROJ.LOADLIB(SZTEST)
//SYSPRINT DD   SYSOUT=A
//SYSTERM  DD   SYSOUT=*
//RUN      EXEC PGM=SZTEST
//STEPLIB  DD   DISP=SHR,DSN=EMCPROJ.LOADLIB(SZTEST)
//SYSPRINT DD   SYSOUT=A
//DUMPDD   DD   SYSOUT=*
//SZP      EXEC PGM=AMASPZAP
//SYSPRINT DD   SYSOUT=A
//SYSLIB   DD   DISP=SHR,DSN=EMCPROJ.LOADLIB
//SYSIN    DD   *
      NAME     SZTEST   SZTEST
      BASE     000000
      REP      000014   0000
/*
//RUN      EXEC PGM=SZTEST
//STEPLIB  DD   DISP=SHR,DSN=EMCPROJ.LOADLIB(SZTEST)
//SYSPRINT DD   SYSOUT=*
//SYSUDUMP DD   SYSOUT=*
//DUMPDD   DD   SYSOUT=*
