//VSAMDEF  JOB
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=A
//SYSIN    DD *
 DEFINE CLUSTER -
 (NAME(EMCPROJ.VSAM4) -
 VOLUMES(ZAIMS1) -
 INDEXED -
 KEYS(8,0) -
 TRACKS(15,16))
/*
