//WRITER   JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DISP=SHR,DSN=EMCPROJ.SRC(WRITER)
//SYSLIN   DD   DISP=SHR,DSN=EMCPROJ.OBJ(WRITER)
//SYSLIB   DD   DISP=SHR,DSN=EMCPROJ.MACLIB
//         DD   DISP=SHR,DSN=SYS1.MACLIB
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//LINKING  EXEC PGM=HEWL,PARM='AC=1'
//SYSLIN   DD   DISP=SHR,DSN=EMCPROJ.OBJ(WRITER)
//SYSLMOD  DD   DISP=SHR,DSN=EMCPROJ.LOADLIB(WRITER)
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//EXECUTE  EXEC PGM=CALLER,PARM='EFREMOV.OUTPUT(DEBUG)'
//STEPLIB  DD   DISP=SHR,DSN=EMCPROJ.LOADLIB(WRITER)
//SYSPRINT DD   SYSOUT=*
//OUTSET   DD   DISP=SHR,DSN=EMCPROJ.OUTPUT(DEBUG),LRECL=80,RECFM=FB,
//             BLKSIZE=80,DSORG=PS
//DUMPDD   DD   SYSOUT=*
