//*ASSEMBLER COMPILATION AND LINKING============================
//COMPLIN  PROC
//CP$&NAME EXEC COMP,NAME=&NAME
//LK$&NAME EXEC PGM=IEWL,PARM='&LINPARM.'
//SYSLIN   DD   DSN=DACF.OBJ(&NAME),DISP=SHR
//SYSLMOD  DD   DSN=DACF.LOADLIB(&NAME),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//         PEND
