//CSCTTST  JOB
//         JCLLIB ORDER=(EMCPROJ.PROCLIB)
//CL1      EXEC ASMCL,NAME='CSCTOUT',LINPARM='AC=1'
//CL2      EXEC ASMCL,NAME='CSCTTST',LINPARM='AC=1'
//GO       EXEC PGM=CSCTOUT
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB,DISP=SHR
//DEBUG    DD   DSN=EMCPROJ.OUTPUT(DEBUG),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
