//DSRVTST  JOB  REGION=0M
//         JCLLIB ORDER=(EMCPROJ.PROCLIB,SYS1.PROCLIB)
//COMPLIN  EXEC ASMCL,NAME='DSRVTST'
//RUN      EXEC PGM=DSRVTST
//STEPLIB  DD   DISP=SHR,DSN=EMCPROJ.LOADLIB
//ADATA    DD   DISP=SHR,DSN=EMCPROJ.PDS
//ADATAM   DD   DISP=SHR,DSN=EMCPROJ.PDS(S1)
//DEBUG    DD   DISP=SHR,DSN=EMCPROJ.OUTPUT(DEBUG)
