//HZSALLCP JOB
//HZSALLCP EXEC PGM=HZSAIEOF,REGION=4096K,TIME=1440
//HZSPDATA DD  DSN=SYS1.HCHECKER.HZSPDATA,DISP=(NEW,CATLG),
//         SPACE=(4096,(100,400)),UNIT=SYSDA,
//         DCB=(DSORG=PS,RECFM=FB,LRECL=4096)
//SYSPRINT DD DUMMY
