//HZSPROC JOB JESLOG=SUPPRESS
//HZSPROC  PROC HZSPRM='00'
//HZSSTEP  EXEC   PGM=HZSINIT,REGION=0K,TIME=NOLIMIT,
//      PARM='SET PARMLIB=&HZSPRM'
//HZSPDATA DD   DSN=SYS1.HCHECKER.HZSPDATA,DISP=OLD
//        PEND
//        EXEC HZSPROC
