//GCCGEN   JOB CLASS=C,REGION=0K
//         JCLLIB ORDER=(EMCPROJ.PROCLIB)
//*
//* This is an example of how to compile using the
//* proc. If your installation has not installed the
//* proc, you will need to execute the compiler
//* directly, using the other example.
//*
//S1 EXEC GCCLS,
//  INFILE='EMCPROJ.GCC(NUMBERS)',
//  OUTFILE='EMCPROJ.LOADLIB(NUMBERS)',
//*  COPTS='-DLOOP',
//  LOPTS='MAP'
//LKED.SYSLIN DD DSN=&&OBJSET,DISP=SHR
//*
//* Note if you have multiple source files in your
//* project, you MAY need specific includes for them,
//* in which case uncomment and add them to this:
//*LKED.SYSIN DD DUMMY
//* You will also need to add an "ENTRY @@MAIN" if you
//* have created an intermediate NCAL for your main
//* program so that the linkage editor can no longer
//* see the original object code.
//*
//*
//*
//* Note - if you want this program to loop, uncomment
//* the COPTS above.
//*
//S2 EXEC PGM=NUMBERS,PARM='20'
//STEPLIB  DD DSN=EMCPROJ.LOADLIB,DISP=SHR
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//DEBUG    DD DISP=SHR,DSN=EMCPROJ.OUTPUT(DEBUG)
//IN80     DD DISP=SHR,DSN=EMCPROJ.D80(IN80)
//IN131    DD DISP=SHR,DSN=EMCPROJ.D131(IN131)
//OUT131   DD DISP=SHR,DSN=EMCPROJ.D131(OUT131)
//
