//SMPLRXX JOB
//STEP1 EXEC PGM=IRXJCL,PARM='SAMPLE A1 B2 C3 D4'
//SYSTSIN DD DSN=EMCPROJ.REXX(SAMPLE),DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSEXEC DD DSN=EMCPROJ.REXX,DISP=SHR
