//S1       JOB
//COMPILE  EXEC  PGM=ASMA90,PARM='ADATA'
//SYSLIB   DD    DISP=SHR,DSN=SYS1.MACLIB
//SYSIN    DD    DISP=SHR,DSN=EMCPROJ.SRC(S1)
//SYSLIN   DD    DISP=SHR,DSN=EMCPROJ.OBJ(S1)
//SYSPRINT DD    DSN=EMCPROJ.LISTING(S1),DISP=SHR
//SYSADATA DD    DSN=EMCPROJ.ADATA(S1),DISP=SHR
//LINK     EXEC  PGM=HEWL
//SYSPRINT DD    SYSOUT=*
//SYSLIN   DD    DSN=EMCPROJ.OBJ(S1),DISP=SHR
//SYSLMOD  DD    DISP=SHR,DSN=EMCPROJ.LOADLIB(S1)
//RUN      EXEC  PGM=S1
//STEPLIB  DD    DISP=SHR,DSN=EMCPROJ.LOADLIB
//SYSPRINT DD    SYSOUT=*
//*SYSMDUMP DD    DISP=(NEW,CATLG,CATLG),DSN=EMCPROG.SYSMDUMP,         X
//*             UNIT=SYSDA,SPACE=(TRK,200),VOL=SER=ZAIMS1
