//SPYM     JOB
//COMPILE  EXEC PGM=ASMA90
//SYSIN    DD   DSN=EMCPROJ.SRC(SPYM),DISP=SHR
//SYSLIB   DD   DSN=EMCPROJ.MACLIB,DISP=SHR
//         DD   DSN=SYS1.MACLIB,DISP=SHR
//         DD   DSN=EMCPROJ.COPY,DISP=SHR
//SYSLIN   DD   DSN=EMCPROJ.OBJ(SPYM),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//BIND     EXEC PGM=HEWL,PARM='EP=MAINLINE,AMODE=31,AC=1'
//SYSLIN   DD   DSN=EMCPROJ.OBJ(SPYM),DISP=SHR
//SYSLMOD  DD   DSN=EMCPROJ.LOADLIB(SPYM),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//RUN      EXEC PGM=SPYM
//SYSIN    DD   *
BINARY=EMCPROJ.LOADLIB         LIBRARY OF LOAD MODULES
LISTING=EMCPROJ.LISTING        LIBRARY OF LISTINGS FOR LOAD MODULES
MAIN=S1                        NAME OF MAIN MODULE
COMMANDS=BR                    SANDBOXED COMMANDS (INTERSCEPTION)
OUTPUT=EMCPROJ.OUTPUT(SPYM)    OUTPUT DATASET FOR TRACE TABLE
/*
//STEPLIB  DD   DSN=EMCPROJ.LOADLIB(SPYM),DISP=SHR
//DEBUG    DD   DSN=EMCPROJ.OUTPUT(DEBUG),DISP=SHR
//DUMPDD   DD   SYSOUT=*
//SYSPRINT DD   SYSOUT=*
