//DIRENTT  JOB CLASS=C,REGION=0K
//         JCLLIB ORDER=(DACF.PROCLIB)
//ASMCOMP  EXEC ASMC,
//  INFILE='DACF.ASM(DIRENTA)',
//  OUTFILE='DACF.OBJ(DIRENTA)'
//GCCMCOMP EXEC GCCCL,
//  INFILE='DACF.GCC(DIRENT)',
//  OUTFILE='DACF.NCALIB(DIRENT)'
//BIND.EMCOBJ DD DISP=SHR,DSN=DACF.OBJ
//BIND.SYSLIN DD *
  INCLUDE OBJSET,EMCOBJ(DIRENTA)
//GCCDCOMP EXEC GCCCL,
//  INFILE='DACF.GCC(DIRENTT)',
//  OUTFILE='DACF.LOADLIB(DIRENTT)'
//BIND.EMCOBJ DD DISP=SHR,DSN=DACF.NCALIB
//BIND.SYSLIN DD *
  INCLUDE OBJSET,EMCOBJ(DIRENT)
//GO       EXEC PGM=DIRENTT
//STEPLIB  DD   DISP=(SHR),DSN=DACF.LOADLIB
//INLIB    DD   DISP=SHR,DSN=EMCPROJ.OUTPUT
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//SYSIN    DD   DUMMY
