//ITOAT    JOB CLASS=C,REGION=0K
//         JCLLIB ORDER=(DACF.PROCLIB)
//GCCICOMP EXEC GCCCL,
//  INFILE='DACF.GCC(ITOAT)',
//  OUTFILE='DACF.LOADLIB(ITOAT)'
//GO       EXEC PGM=ITOAT
//STEPLIB  DD   DISP=(SHR),DSN=DACF.LOADLIB
//SYSPRINT DD   SYSOUT=*
//SYSTERM  DD   SYSOUT=*
//SYSIN    DD   DUMMY
