//SPYMG    JOB CLASS=C,REGION=0K
//         JCLLIB ORDER=(DACF.PROCLIB,SYS1.PROCLIB,ADCD.Z110.PROCLIB)
//GO       EXEC SPYMRUN,
//  MAIN=''
//BLDTBL.ADATA DD DSN=DACF.ADATA
//BACKUP.SYSIN DD DSN=DACF.BINARY
//GO.SPYM$OUT  DD DUMMY
