//TSTLP    JOB
//         JCLLIB ORDER=(DACF.PROCLIB)
//COMPILE1 EXEC ASMCL,ASMAOPTS='ADATA',
//  INFILE='DACF.ASM(TSTLP)',
//  OUTFILE='DACF.LOADLIB(TSTLP)'
//COMPILE.SYSADATA DD DISP=SHR,DSN=DACF.ADATA(TSTLP)
//SMPL1RUN EXEC PGM=TSTLP
//STEPLIB  DD   DISP=SHR,DSN=DACF.LOADLIB
//SYSPRINT DD   SYSOUT=*
